/* automatically generated by rust-bindgen 0.69.4 */
#![allow(warnings)]

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const FORMAT_BLx: &[u8; 5] = b"0x%x\0";
pub const FORMAT_RD: &[u8; 3] = b"%g\0";
pub const FORMAT_RLLx: &[u8; 5] = b"%llX\0";
pub const FORMAT_RLL: &[u8; 7] = b"0x%llX\0";
pub const FORMAT_RLLd: &[u8; 5] = b"%lld\0";
pub const FORMAT_BLL: &[u8; 5] = b"%llu\0";
pub const FORMAT_MC: &[u8; 3] = b"%d\0";
pub const FORMAT_UMC: &[u8; 7] = b"0x%llX\0";
pub const FORMAT_MS: &[u8; 3] = b"%u\0";
pub const FORMAT_TF: &[u8; 5] = b"\"%s\"\0";
pub const FORMAT_TV: &[u8; 5] = b"\"%s\"\0";
pub const FORMAT_T16: &[u8; 5] = b"\"%s\"\0";
pub const FORMAT_T32: &[u8; 5] = b"\"%s\"\0";
pub const FORMAT_TU32: &[u8; 5] = b"\"%s\"\0";
pub const FORMAT_BT: &[u8; 3] = b"%g\0";
pub const FORMAT_DD: &[u8; 3] = b"%g\0";
pub const FORMAT_BD: &[u8; 3] = b"%g\0";
pub const FORMAT_4BITS: &[u8; 4] = b"%1x\0";
pub const FORMAT_D2T: &[u8; 3] = b"%s\0";
pub const FORMAT_TU: &[u8; 6] = b"\"%hn\"\0";
pub const FORMAT_H: &[u8; 11] = b"%u.%u.%llX\0";
pub const FORMAT_REF: &[u8; 22] = b"(%u.%u.%llX) abs:%llu\0";
pub const FORMAT_REF11: &[u8; 16] = b"(%d, %hd, %llu)\0";
pub const DWG_OPTS_LOGLEVEL: u32 = 15;
pub const DWG_OPTS_MINIMAL: u32 = 16;
pub const DWG_OPTS_DXFB: u32 = 32;
pub const DWG_OPTS_JSONFIRST: u32 = 32;
pub const DWG_OPTS_INDXF: u32 = 64;
pub const DWG_OPTS_INJSON: u32 = 128;
pub const DWG_OPTS_IN: u32 = 192;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_lc_codepage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(mbcinfo)
        )
    );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _iobuf {
    pub _Placeholder: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__iobuf() {
    const UNINIT: ::std::mem::MaybeUninit<_iobuf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_iobuf>(),
        8usize,
        concat!("Size of: ", stringify!(_iobuf))
    );
    assert_eq!(
        ::std::mem::align_of::<_iobuf>(),
        8usize,
        concat!("Alignment of ", stringify!(_iobuf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Placeholder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_iobuf),
            "::",
            stringify!(_Placeholder)
        )
    );
}
pub type FILE = _iobuf;
extern "C" {
    pub fn __acrt_iob_func(_Ix: ::std::os::raw::c_uint) -> *mut FILE;
}
extern "C" {
    pub fn fgetwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fgetwchar() -> wint_t;
}
extern "C" {
    pub fn fputwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwchar(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn getwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn getwchar() -> wint_t;
}
extern "C" {
    pub fn fgetws(
        _Buffer: *mut wchar_t,
        _BufferCount: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn fputws(_Buffer: *const wchar_t, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getws_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn putwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn putwchar(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn _putws(_Buffer: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetwc(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _wfdopen(_FileHandle: ::std::os::raw::c_int, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen(_FileName: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wfreopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _wfreopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn _wfsopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _ShFlag: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _wperror(_ErrorMessage: *const wchar_t);
}
extern "C" {
    pub fn _wpopen(_Command: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wremove(_FileName: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtempnam(_Directory: *const wchar_t, _FilePrefix: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wtmpnam_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> errno_t;
}
extern "C" {
    pub fn _wtmpnam(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _fgetwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _getwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _putwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _ungetwc_nolock(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn __stdio_common_vfwprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsnwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *const wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
pub type fpos_t = ::std::os::raw::c_longlong;
extern "C" {
    pub fn _get_stream_buffer_pointers(
        _Stream: *mut FILE,
        _Base: *mut *mut *mut ::std::os::raw::c_char,
        _Pointer: *mut *mut *mut ::std::os::raw::c_char,
        _Count: *mut *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn clearerr_s(_Stream: *mut FILE) -> errno_t;
}
extern "C" {
    pub fn fopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn fread_s(
        _Buffer: *mut ::std::os::raw::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn freopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn gets_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _Size: rsize_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpfile_s(_Stream: *mut *mut FILE) -> errno_t;
}
extern "C" {
    pub fn tmpnam_s(_Buffer: *mut ::std::os::raw::c_char, _Size: rsize_t) -> errno_t;
}
extern "C" {
    pub fn clearerr(_Stream: *mut FILE);
}
extern "C" {
    pub fn fclose(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fcloseall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fdopen(
        _FileHandle: ::std::os::raw::c_int,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn feof(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fgetchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetpos(_Stream: *mut FILE, _Position: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        _Buffer: *mut ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _fileno(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _flushall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fputc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fputchar(_Character: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputs(
        _Buffer: *const ::std::os::raw::c_char,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        _Buffer: *mut ::std::os::raw::c_void,
        _ElementSize: ::std::os::raw::c_ulonglong,
        _ElementCount: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn freopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _Stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fsopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _ShFlag: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fsetpos(_Stream: *mut FILE, _Position: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseek(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_long,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fseeki64(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_longlong,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(_Stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _ftelli64(_Stream: *mut FILE) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fwrite(
        _Buffer: *const ::std::os::raw::c_void,
        _ElementSize: ::std::os::raw::c_ulonglong,
        _ElementCount: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn getc(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getmaxstdio() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getw(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(_ErrorMessage: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn _pclose(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _popen(
        _Command: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn putc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(_Character: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(_Buffer: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putw(_Word: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        _OldFileName: *const ::std::os::raw::c_char,
        _NewFileName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _unlink(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlink(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rewind(_Stream: *mut FILE);
}
extern "C" {
    pub fn _rmtmp() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(_Stream: *mut FILE, _Buffer: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn _setmaxstdio(_Maximum: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setvbuf(
        _Stream: *mut FILE,
        _Buffer: *mut ::std::os::raw::c_char,
        _Mode: ::std::os::raw::c_int,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _tempnam(
        _DirectoryName: *const ::std::os::raw::c_char,
        _FilePrefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(_Buffer: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ungetc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _lock_file(_Stream: *mut FILE);
}
extern "C" {
    pub fn _unlock_file(_Stream: *mut FILE);
}
extern "C" {
    pub fn _fclose_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fflush_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fgetc_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fputc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fread_nolock(
        _Buffer: *mut ::std::os::raw::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fread_nolock_s(
        _Buffer: *mut ::std::os::raw::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fseek_nolock(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_long,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fseeki64_nolock(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_longlong,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _ftell_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _ftelli64_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _fwrite_nolock(
        _Buffer: *const ::std::os::raw::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _getc_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _ungetc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __p__commode() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_printf_count_output(_Value: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _get_printf_count_output() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _Arglist: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsnprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *const ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tempnam(
        _Directory: *const ::std::os::raw::c_char,
        _FilePrefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcloseall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fdopen(
        _FileHandle: ::std::os::raw::c_int,
        _Format: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fgetchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flushall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputchar(_Ch: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(_Ch: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rmtmp() -> ::std::os::raw::c_int;
}
pub type max_align_t = f64;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Lldiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[test]
fn bindgen_test_layout__Lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<_Lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(_Lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_Lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_Lldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_Lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type imaxdiv_t = _Lldiv_t;
extern "C" {
    pub fn imaxabs(_Number: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(_Numerator: intmax_t, _Denominator: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn _strtoimax_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn _strtoumax_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn _wcstoimax_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn _wcstoumax_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> uintmax_t;
}
pub type BITCODE_RC = ::std::os::raw::c_uchar;
pub type BITCODE_RCd = ::std::os::raw::c_schar;
pub type BITCODE_RCu = ::std::os::raw::c_uchar;
pub type BITCODE_RCx = ::std::os::raw::c_uchar;
pub type BITCODE_B = ::std::os::raw::c_uchar;
pub type BITCODE_BB = ::std::os::raw::c_uchar;
pub type BITCODE_3B = ::std::os::raw::c_uchar;
pub type BITCODE_BS = u16;
pub type BITCODE_BSd = i16;
pub type BITCODE_BSx = u16;
pub type BITCODE_RS = u16;
pub type BITCODE_RSd = i16;
pub type BITCODE_RSx = u16;
pub type BITCODE_BL = u32;
pub type BITCODE_BLx = u32;
pub type BITCODE_BLd = i32;
pub type BITCODE_RL = u32;
pub type BITCODE_RLx = u32;
pub type BITCODE_RLd = i32;
pub type BITCODE_RD = f64;
pub type BITCODE_RLL = u64;
pub type BITCODE_RLLd = i64;
pub type BITCODE_BLL = u64;
pub type BITCODE_MC = i32;
pub type BITCODE_UMC = u64;
pub type BITCODE_MS = BITCODE_BL;
pub type dwg_wchar_t = BITCODE_RS;
pub type BITCODE_TF = *mut ::std::os::raw::c_uchar;
pub type BITCODE_TV = *mut ::std::os::raw::c_char;
pub type BITCODE_BT = f64;
pub type BITCODE_DD = f64;
pub type BITCODE_BD = f64;
pub type BITCODE_4BITS = BITCODE_RC;
pub type BITCODE_D2T = BITCODE_TV;
pub type BITCODE_TU = *mut BITCODE_RS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_time_bll {
    pub days: BITCODE_BL,
    pub ms: BITCODE_BL,
    pub value: BITCODE_BD,
}
#[test]
fn bindgen_test_layout__dwg_time_bll() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_time_bll> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_time_bll>(),
        16usize,
        concat!("Size of: ", stringify!(_dwg_time_bll))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_time_bll>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_time_bll))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).days) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_time_bll),
            "::",
            stringify!(days)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ms) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_time_bll),
            "::",
            stringify!(ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_time_bll),
            "::",
            stringify!(value)
        )
    );
}
pub type Dwg_Bitcode_TimeBLL = _dwg_time_bll;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_bitcode_2rd {
    pub x: BITCODE_RD,
    pub y: BITCODE_RD,
}
#[test]
fn bindgen_test_layout__dwg_bitcode_2rd() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_bitcode_2rd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_bitcode_2rd>(),
        16usize,
        concat!("Size of: ", stringify!(_dwg_bitcode_2rd))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_bitcode_2rd>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_bitcode_2rd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_2rd),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_2rd),
            "::",
            stringify!(y)
        )
    );
}
pub type Dwg_Bitcode_2RD = _dwg_bitcode_2rd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_bitcode_2bd {
    pub x: BITCODE_BD,
    pub y: BITCODE_BD,
}
#[test]
fn bindgen_test_layout__dwg_bitcode_2bd() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_bitcode_2bd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_bitcode_2bd>(),
        16usize,
        concat!("Size of: ", stringify!(_dwg_bitcode_2bd))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_bitcode_2bd>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_bitcode_2bd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_2bd),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_2bd),
            "::",
            stringify!(y)
        )
    );
}
pub type Dwg_Bitcode_2BD = _dwg_bitcode_2bd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_bitcode_3rd {
    pub x: BITCODE_RD,
    pub y: BITCODE_RD,
    pub z: BITCODE_RD,
}
#[test]
fn bindgen_test_layout__dwg_bitcode_3rd() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_bitcode_3rd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_bitcode_3rd>(),
        24usize,
        concat!("Size of: ", stringify!(_dwg_bitcode_3rd))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_bitcode_3rd>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_bitcode_3rd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_3rd),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_3rd),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_3rd),
            "::",
            stringify!(z)
        )
    );
}
pub type Dwg_Bitcode_3RD = _dwg_bitcode_3rd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_bitcode_3bd {
    pub x: BITCODE_BD,
    pub y: BITCODE_BD,
    pub z: BITCODE_BD,
}
#[test]
fn bindgen_test_layout__dwg_bitcode_3bd() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_bitcode_3bd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_bitcode_3bd>(),
        24usize,
        concat!("Size of: ", stringify!(_dwg_bitcode_3bd))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_bitcode_3bd>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_bitcode_3bd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_3bd),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_3bd),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_bitcode_3bd),
            "::",
            stringify!(z)
        )
    );
}
pub type Dwg_Bitcode_3BD = _dwg_bitcode_3bd;
pub type BITCODE_TIMEBLL = Dwg_Bitcode_TimeBLL;
pub type BITCODE_TIMERLL = Dwg_Bitcode_TimeBLL;
pub type BITCODE_2RD = Dwg_Bitcode_2RD;
pub type BITCODE_2BD = Dwg_Bitcode_2BD;
pub type BITCODE_2DPOINT = Dwg_Bitcode_2BD;
pub type BITCODE_2BD_1 = Dwg_Bitcode_2BD;
pub type BITCODE_3RD = Dwg_Bitcode_3RD;
pub type BITCODE_3BD = Dwg_Bitcode_3BD;
pub type BITCODE_3DPOINT = Dwg_Bitcode_3BD;
pub type BITCODE_3BD_1 = Dwg_Bitcode_3BD;
pub type BITCODE_BE = Dwg_Bitcode_3BD;
pub const DWG_VERSION_TYPE_R_INVALID: DWG_VERSION_TYPE = 0;
pub const DWG_VERSION_TYPE_R_1_1: DWG_VERSION_TYPE = 1;
pub const DWG_VERSION_TYPE_R_1_2: DWG_VERSION_TYPE = 2;
pub const DWG_VERSION_TYPE_R_1_3: DWG_VERSION_TYPE = 3;
pub const DWG_VERSION_TYPE_R_1_4: DWG_VERSION_TYPE = 4;
pub const DWG_VERSION_TYPE_R_2_0b: DWG_VERSION_TYPE = 5;
pub const DWG_VERSION_TYPE_R_2_0: DWG_VERSION_TYPE = 6;
pub const DWG_VERSION_TYPE_R_2_10: DWG_VERSION_TYPE = 7;
pub const DWG_VERSION_TYPE_R_2_21: DWG_VERSION_TYPE = 8;
pub const DWG_VERSION_TYPE_R_2_22: DWG_VERSION_TYPE = 9;
pub const DWG_VERSION_TYPE_R_2_4: DWG_VERSION_TYPE = 10;
pub const DWG_VERSION_TYPE_R_2_5: DWG_VERSION_TYPE = 11;
pub const DWG_VERSION_TYPE_R_2_6: DWG_VERSION_TYPE = 12;
pub const DWG_VERSION_TYPE_R_9: DWG_VERSION_TYPE = 13;
pub const DWG_VERSION_TYPE_R_9c1: DWG_VERSION_TYPE = 14;
pub const DWG_VERSION_TYPE_R_10: DWG_VERSION_TYPE = 15;
pub const DWG_VERSION_TYPE_R_11b1: DWG_VERSION_TYPE = 16;
pub const DWG_VERSION_TYPE_R_11b2: DWG_VERSION_TYPE = 17;
pub const DWG_VERSION_TYPE_R_11: DWG_VERSION_TYPE = 18;
pub const DWG_VERSION_TYPE_R_12: DWG_VERSION_TYPE = 18;
pub const DWG_VERSION_TYPE_R_13b1: DWG_VERSION_TYPE = 19;
pub const DWG_VERSION_TYPE_R_13b2: DWG_VERSION_TYPE = 20;
pub const DWG_VERSION_TYPE_R_13: DWG_VERSION_TYPE = 21;
pub const DWG_VERSION_TYPE_R_13c3: DWG_VERSION_TYPE = 22;
pub const DWG_VERSION_TYPE_R_14: DWG_VERSION_TYPE = 23;
pub const DWG_VERSION_TYPE_R_2000b: DWG_VERSION_TYPE = 24;
pub const DWG_VERSION_TYPE_R_2000: DWG_VERSION_TYPE = 25;
pub const DWG_VERSION_TYPE_R_2000i: DWG_VERSION_TYPE = 26;
pub const DWG_VERSION_TYPE_R_2002: DWG_VERSION_TYPE = 27;
pub const DWG_VERSION_TYPE_R_2004a: DWG_VERSION_TYPE = 28;
pub const DWG_VERSION_TYPE_R_2004b: DWG_VERSION_TYPE = 29;
pub const DWG_VERSION_TYPE_R_2004c: DWG_VERSION_TYPE = 30;
pub const DWG_VERSION_TYPE_R_2004: DWG_VERSION_TYPE = 31;
pub const DWG_VERSION_TYPE_R_2007a: DWG_VERSION_TYPE = 32;
pub const DWG_VERSION_TYPE_R_2007b: DWG_VERSION_TYPE = 33;
pub const DWG_VERSION_TYPE_R_2007: DWG_VERSION_TYPE = 34;
pub const DWG_VERSION_TYPE_R_2010b: DWG_VERSION_TYPE = 35;
pub const DWG_VERSION_TYPE_R_2010: DWG_VERSION_TYPE = 36;
pub const DWG_VERSION_TYPE_R_2013b: DWG_VERSION_TYPE = 37;
pub const DWG_VERSION_TYPE_R_2013: DWG_VERSION_TYPE = 38;
pub const DWG_VERSION_TYPE_R_2018b: DWG_VERSION_TYPE = 39;
pub const DWG_VERSION_TYPE_R_2018: DWG_VERSION_TYPE = 40;
pub const DWG_VERSION_TYPE_R_2022b: DWG_VERSION_TYPE = 41;
pub const DWG_VERSION_TYPE_R_AFTER: DWG_VERSION_TYPE = 42;
pub type DWG_VERSION_TYPE = ::std::os::raw::c_int;
pub use self::DWG_VERSION_TYPE as Dwg_Version_Type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dwg_versions {
    pub r: Dwg_Version_Type,
    pub type_: *const ::std::os::raw::c_char,
    pub hdr: *const ::std::os::raw::c_char,
    pub desc: *const ::std::os::raw::c_char,
    pub dwg_version: u8,
}
#[test]
fn bindgen_test_layout_dwg_versions() {
    const UNINIT: ::std::mem::MaybeUninit<dwg_versions> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dwg_versions>(),
        40usize,
        concat!("Size of: ", stringify!(dwg_versions))
    );
    assert_eq!(
        ::std::mem::align_of::<dwg_versions>(),
        8usize,
        concat!("Alignment of ", stringify!(dwg_versions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dwg_versions),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dwg_versions),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hdr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dwg_versions),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).desc) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dwg_versions),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwg_version) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dwg_versions),
            "::",
            stringify!(dwg_version)
        )
    );
}
pub type Dwg_Versions = dwg_versions;
pub const DWG_CLASS_STABILITY_DWG_CLASS_STABLE: DWG_CLASS_STABILITY = 0;
pub const DWG_CLASS_STABILITY_DWG_CLASS_UNSTABLE: DWG_CLASS_STABILITY = 1;
pub const DWG_CLASS_STABILITY_DWG_CLASS_DEBUGGING: DWG_CLASS_STABILITY = 2;
pub const DWG_CLASS_STABILITY_DWG_CLASS_UNHANDLED: DWG_CLASS_STABILITY = 3;
pub type DWG_CLASS_STABILITY = ::std::os::raw::c_int;
pub use self::DWG_CLASS_STABILITY as Dwg_Class_Stability;
pub const DWG_ENTITY_SECTIONS_DWG_ENTITY_SECTION: DWG_ENTITY_SECTIONS = 0;
pub const DWG_ENTITY_SECTIONS_DWG_BLOCKS_SECTION: DWG_ENTITY_SECTIONS = 64;
pub const DWG_ENTITY_SECTIONS_DWG_EXTRA_SECTION: DWG_ENTITY_SECTIONS = 128;
pub type DWG_ENTITY_SECTIONS = ::std::os::raw::c_int;
pub use self::DWG_ENTITY_SECTIONS as Dwg_Entity_Sections;
pub const DWG_OBJECT_SUPERTYPE_DWG_SUPERTYPE_ENTITY: DWG_OBJECT_SUPERTYPE = 0;
pub const DWG_OBJECT_SUPERTYPE_DWG_SUPERTYPE_OBJECT: DWG_OBJECT_SUPERTYPE = 1;
#[doc = "Object supertypes that exist in dwg-files."]
pub type DWG_OBJECT_SUPERTYPE = ::std::os::raw::c_int;
#[doc = "Object supertypes that exist in dwg-files."]
pub use self::DWG_OBJECT_SUPERTYPE as Dwg_Object_Supertype;
pub const DWG_OBJECT_TYPE_DWG_TYPE_UNUSED: DWG_OBJECT_TYPE = 0;
pub const DWG_OBJECT_TYPE_DWG_TYPE_TEXT: DWG_OBJECT_TYPE = 1;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ATTRIB: DWG_OBJECT_TYPE = 2;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ATTDEF: DWG_OBJECT_TYPE = 3;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCK: DWG_OBJECT_TYPE = 4;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ENDBLK: DWG_OBJECT_TYPE = 5;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SEQEND: DWG_OBJECT_TYPE = 6;
pub const DWG_OBJECT_TYPE_DWG_TYPE_INSERT: DWG_OBJECT_TYPE = 7;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MINSERT: DWG_OBJECT_TYPE = 8;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VERTEX_2D: DWG_OBJECT_TYPE = 10;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VERTEX_3D: DWG_OBJECT_TYPE = 11;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VERTEX_MESH: DWG_OBJECT_TYPE = 12;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VERTEX_PFACE: DWG_OBJECT_TYPE = 13;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VERTEX_PFACE_FACE: DWG_OBJECT_TYPE = 14;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POLYLINE_2D: DWG_OBJECT_TYPE = 15;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POLYLINE_3D: DWG_OBJECT_TYPE = 16;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ARC: DWG_OBJECT_TYPE = 17;
pub const DWG_OBJECT_TYPE_DWG_TYPE_CIRCLE: DWG_OBJECT_TYPE = 18;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LINE: DWG_OBJECT_TYPE = 19;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMENSION_ORDINATE: DWG_OBJECT_TYPE = 20;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMENSION_LINEAR: DWG_OBJECT_TYPE = 21;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMENSION_ALIGNED: DWG_OBJECT_TYPE = 22;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMENSION_ANG3PT: DWG_OBJECT_TYPE = 23;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMENSION_ANG2LN: DWG_OBJECT_TYPE = 24;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMENSION_RADIUS: DWG_OBJECT_TYPE = 25;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMENSION_DIAMETER: DWG_OBJECT_TYPE = 26;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINT: DWG_OBJECT_TYPE = 27;
pub const DWG_OBJECT_TYPE_DWG_TYPE__3DFACE: DWG_OBJECT_TYPE = 28;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POLYLINE_PFACE: DWG_OBJECT_TYPE = 29;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POLYLINE_MESH: DWG_OBJECT_TYPE = 30;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SOLID: DWG_OBJECT_TYPE = 31;
pub const DWG_OBJECT_TYPE_DWG_TYPE_TRACE: DWG_OBJECT_TYPE = 32;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SHAPE: DWG_OBJECT_TYPE = 33;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VIEWPORT: DWG_OBJECT_TYPE = 34;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ELLIPSE: DWG_OBJECT_TYPE = 35;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SPLINE: DWG_OBJECT_TYPE = 36;
pub const DWG_OBJECT_TYPE_DWG_TYPE_REGION: DWG_OBJECT_TYPE = 37;
pub const DWG_OBJECT_TYPE_DWG_TYPE__3DSOLID: DWG_OBJECT_TYPE = 38;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BODY: DWG_OBJECT_TYPE = 39;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RAY: DWG_OBJECT_TYPE = 40;
pub const DWG_OBJECT_TYPE_DWG_TYPE_XLINE: DWG_OBJECT_TYPE = 41;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DICTIONARY: DWG_OBJECT_TYPE = 42;
pub const DWG_OBJECT_TYPE_DWG_TYPE_OLEFRAME: DWG_OBJECT_TYPE = 43;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MTEXT: DWG_OBJECT_TYPE = 44;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LEADER: DWG_OBJECT_TYPE = 45;
pub const DWG_OBJECT_TYPE_DWG_TYPE_TOLERANCE: DWG_OBJECT_TYPE = 46;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MLINE: DWG_OBJECT_TYPE = 47;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCK_CONTROL: DWG_OBJECT_TYPE = 48;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCK_HEADER: DWG_OBJECT_TYPE = 49;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LAYER_CONTROL: DWG_OBJECT_TYPE = 50;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LAYER: DWG_OBJECT_TYPE = 51;
pub const DWG_OBJECT_TYPE_DWG_TYPE_STYLE_CONTROL: DWG_OBJECT_TYPE = 52;
pub const DWG_OBJECT_TYPE_DWG_TYPE_STYLE: DWG_OBJECT_TYPE = 53;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LTYPE_CONTROL: DWG_OBJECT_TYPE = 56;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LTYPE: DWG_OBJECT_TYPE = 57;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VIEW_CONTROL: DWG_OBJECT_TYPE = 60;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VIEW: DWG_OBJECT_TYPE = 61;
pub const DWG_OBJECT_TYPE_DWG_TYPE_UCS_CONTROL: DWG_OBJECT_TYPE = 62;
pub const DWG_OBJECT_TYPE_DWG_TYPE_UCS: DWG_OBJECT_TYPE = 63;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VPORT_CONTROL: DWG_OBJECT_TYPE = 64;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VPORT: DWG_OBJECT_TYPE = 65;
pub const DWG_OBJECT_TYPE_DWG_TYPE_APPID_CONTROL: DWG_OBJECT_TYPE = 66;
pub const DWG_OBJECT_TYPE_DWG_TYPE_APPID: DWG_OBJECT_TYPE = 67;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMSTYLE_CONTROL: DWG_OBJECT_TYPE = 68;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMSTYLE: DWG_OBJECT_TYPE = 69;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VX_CONTROL: DWG_OBJECT_TYPE = 70;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VX_TABLE_RECORD: DWG_OBJECT_TYPE = 71;
pub const DWG_OBJECT_TYPE_DWG_TYPE_GROUP: DWG_OBJECT_TYPE = 72;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MLINESTYLE: DWG_OBJECT_TYPE = 73;
pub const DWG_OBJECT_TYPE_DWG_TYPE_OLE2FRAME: DWG_OBJECT_TYPE = 74;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DUMMY: DWG_OBJECT_TYPE = 75;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LONG_TRANSACTION: DWG_OBJECT_TYPE = 76;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LWPOLYLINE: DWG_OBJECT_TYPE = 77;
pub const DWG_OBJECT_TYPE_DWG_TYPE_HATCH: DWG_OBJECT_TYPE = 78;
pub const DWG_OBJECT_TYPE_DWG_TYPE_XRECORD: DWG_OBJECT_TYPE = 79;
pub const DWG_OBJECT_TYPE_DWG_TYPE_PLACEHOLDER: DWG_OBJECT_TYPE = 80;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VBA_PROJECT: DWG_OBJECT_TYPE = 81;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LAYOUT: DWG_OBJECT_TYPE = 82;
pub const DWG_OBJECT_TYPE_DWG_TYPE_PROXY_ENTITY: DWG_OBJECT_TYPE = 498;
pub const DWG_OBJECT_TYPE_DWG_TYPE_PROXY_OBJECT: DWG_OBJECT_TYPE = 499;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACDSRECORD: DWG_OBJECT_TYPE = 500;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACDSSCHEMA: DWG_OBJECT_TYPE = 501;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACMECOMMANDHISTORY: DWG_OBJECT_TYPE = 502;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACMESCOPE: DWG_OBJECT_TYPE = 503;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACMESTATEMGR: DWG_OBJECT_TYPE = 504;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_BOOLEAN_CLASS: DWG_OBJECT_TYPE = 505;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_BOX_CLASS: DWG_OBJECT_TYPE = 506;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_BREP_CLASS: DWG_OBJECT_TYPE = 507;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_CHAMFER_CLASS: DWG_OBJECT_TYPE = 508;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_CONE_CLASS: DWG_OBJECT_TYPE = 509;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_CYLINDER_CLASS: DWG_OBJECT_TYPE = 510;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_EXTRUSION_CLASS: DWG_OBJECT_TYPE = 511;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_FILLET_CLASS: DWG_OBJECT_TYPE = 512;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_HISTORY_CLASS: DWG_OBJECT_TYPE = 513;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_LOFT_CLASS: DWG_OBJECT_TYPE = 514;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_PYRAMID_CLASS: DWG_OBJECT_TYPE = 515;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_REVOLVE_CLASS: DWG_OBJECT_TYPE = 516;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_SPHERE_CLASS: DWG_OBJECT_TYPE = 517;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_SWEEP_CLASS: DWG_OBJECT_TYPE = 518;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_TORUS_CLASS: DWG_OBJECT_TYPE = 519;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ACSH_WEDGE_CLASS: DWG_OBJECT_TYPE = 520;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ALDIMOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 521;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ALIGNMENTPARAMETERENTITY: DWG_OBJECT_TYPE = 522;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ANGDIMOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 523;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ANNOTSCALEOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 524;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ARCALIGNEDTEXT: DWG_OBJECT_TYPE = 525;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ARC_DIMENSION: DWG_OBJECT_TYPE = 526;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOC2DCONSTRAINTGROUP: DWG_OBJECT_TYPE = 527;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOC3POINTANGULARDIMACTIONBODY: DWG_OBJECT_TYPE = 528;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCACTION: DWG_OBJECT_TYPE = 529;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCACTIONPARAM: DWG_OBJECT_TYPE = 530;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCALIGNEDDIMACTIONBODY: DWG_OBJECT_TYPE = 531;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCARRAYACTIONBODY: DWG_OBJECT_TYPE = 532;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCARRAYMODIFYACTIONBODY: DWG_OBJECT_TYPE = 533;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCARRAYMODIFYPARAMETERS: DWG_OBJECT_TYPE = 534;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCARRAYPATHPARAMETERS: DWG_OBJECT_TYPE = 535;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCARRAYPOLARPARAMETERS: DWG_OBJECT_TYPE = 536;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCARRAYRECTANGULARPARAMETERS: DWG_OBJECT_TYPE = 537;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCASMBODYACTIONPARAM: DWG_OBJECT_TYPE = 538;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCBLENDSURFACEACTIONBODY: DWG_OBJECT_TYPE = 539;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCCOMPOUNDACTIONPARAM: DWG_OBJECT_TYPE = 540;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCDEPENDENCY: DWG_OBJECT_TYPE = 541;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCDIMDEPENDENCYBODY: DWG_OBJECT_TYPE = 542;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCEDGEACTIONPARAM: DWG_OBJECT_TYPE = 543;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCEDGECHAMFERACTIONBODY: DWG_OBJECT_TYPE = 544;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCEDGEFILLETACTIONBODY: DWG_OBJECT_TYPE = 545;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCEXTENDSURFACEACTIONBODY: DWG_OBJECT_TYPE = 546;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCEXTRUDEDSURFACEACTIONBODY: DWG_OBJECT_TYPE = 547;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCFACEACTIONPARAM: DWG_OBJECT_TYPE = 548;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCFILLETSURFACEACTIONBODY: DWG_OBJECT_TYPE = 549;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCGEOMDEPENDENCY: DWG_OBJECT_TYPE = 550;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCLOFTEDSURFACEACTIONBODY: DWG_OBJECT_TYPE = 551;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCMLEADERACTIONBODY: DWG_OBJECT_TYPE = 552;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCNETWORK: DWG_OBJECT_TYPE = 553;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCNETWORKSURFACEACTIONBODY: DWG_OBJECT_TYPE = 554;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCOBJECTACTIONPARAM: DWG_OBJECT_TYPE = 555;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCOFFSETSURFACEACTIONBODY: DWG_OBJECT_TYPE = 556;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCORDINATEDIMACTIONBODY: DWG_OBJECT_TYPE = 557;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCOSNAPPOINTREFACTIONPARAM: DWG_OBJECT_TYPE = 558;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCPATCHSURFACEACTIONBODY: DWG_OBJECT_TYPE = 559;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCPATHACTIONPARAM: DWG_OBJECT_TYPE = 560;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCPERSSUBENTMANAGER: DWG_OBJECT_TYPE = 561;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCPLANESURFACEACTIONBODY: DWG_OBJECT_TYPE = 562;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCPOINTREFACTIONPARAM: DWG_OBJECT_TYPE = 563;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCRESTOREENTITYSTATEACTIONBODY: DWG_OBJECT_TYPE = 564;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCREVOLVEDSURFACEACTIONBODY: DWG_OBJECT_TYPE = 565;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCROTATEDDIMACTIONBODY: DWG_OBJECT_TYPE = 566;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCSWEPTSURFACEACTIONBODY: DWG_OBJECT_TYPE = 567;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCTRIMSURFACEACTIONBODY: DWG_OBJECT_TYPE = 568;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCVALUEDEPENDENCY: DWG_OBJECT_TYPE = 569;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCVARIABLE: DWG_OBJECT_TYPE = 570;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ASSOCVERTEXACTIONPARAM: DWG_OBJECT_TYPE = 571;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BASEPOINTPARAMETERENTITY: DWG_OBJECT_TYPE = 572;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLKREFOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 573;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKALIGNEDCONSTRAINTPARAMETER: DWG_OBJECT_TYPE = 574;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKALIGNMENTGRIP: DWG_OBJECT_TYPE = 575;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKALIGNMENTPARAMETER: DWG_OBJECT_TYPE = 576;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKANGULARCONSTRAINTPARAMETER: DWG_OBJECT_TYPE = 577;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKARRAYACTION: DWG_OBJECT_TYPE = 578;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKBASEPOINTPARAMETER: DWG_OBJECT_TYPE = 579;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKDIAMETRICCONSTRAINTPARAMETER: DWG_OBJECT_TYPE = 580;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKFLIPACTION: DWG_OBJECT_TYPE = 581;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKFLIPGRIP: DWG_OBJECT_TYPE = 582;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKFLIPPARAMETER: DWG_OBJECT_TYPE = 583;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKGRIPLOCATIONCOMPONENT: DWG_OBJECT_TYPE = 584;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKHORIZONTALCONSTRAINTPARAMETER: DWG_OBJECT_TYPE = 585;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKLINEARCONSTRAINTPARAMETER: DWG_OBJECT_TYPE = 586;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKLINEARGRIP: DWG_OBJECT_TYPE = 587;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKLINEARPARAMETER: DWG_OBJECT_TYPE = 588;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKLOOKUPACTION: DWG_OBJECT_TYPE = 589;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKLOOKUPGRIP: DWG_OBJECT_TYPE = 590;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKLOOKUPPARAMETER: DWG_OBJECT_TYPE = 591;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKMOVEACTION: DWG_OBJECT_TYPE = 592;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKPARAMDEPENDENCYBODY: DWG_OBJECT_TYPE = 593;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKPOINTPARAMETER: DWG_OBJECT_TYPE = 594;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKPOLARGRIP: DWG_OBJECT_TYPE = 595;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKPOLARPARAMETER: DWG_OBJECT_TYPE = 596;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKPOLARSTRETCHACTION: DWG_OBJECT_TYPE = 597;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKPROPERTIESTABLE: DWG_OBJECT_TYPE = 598;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKPROPERTIESTABLEGRIP: DWG_OBJECT_TYPE = 599;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKRADIALCONSTRAINTPARAMETER: DWG_OBJECT_TYPE = 600;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKREPRESENTATION: DWG_OBJECT_TYPE = 601;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKROTATEACTION: DWG_OBJECT_TYPE = 602;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKROTATIONGRIP: DWG_OBJECT_TYPE = 603;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKROTATIONPARAMETER: DWG_OBJECT_TYPE = 604;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKSCALEACTION: DWG_OBJECT_TYPE = 605;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKSTRETCHACTION: DWG_OBJECT_TYPE = 606;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKUSERPARAMETER: DWG_OBJECT_TYPE = 607;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKVERTICALCONSTRAINTPARAMETER: DWG_OBJECT_TYPE = 608;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKVISIBILITYGRIP: DWG_OBJECT_TYPE = 609;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKVISIBILITYPARAMETER: DWG_OBJECT_TYPE = 610;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKXYGRIP: DWG_OBJECT_TYPE = 611;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BLOCKXYPARAMETER: DWG_OBJECT_TYPE = 612;
pub const DWG_OBJECT_TYPE_DWG_TYPE_CAMERA: DWG_OBJECT_TYPE = 613;
pub const DWG_OBJECT_TYPE_DWG_TYPE_CELLSTYLEMAP: DWG_OBJECT_TYPE = 614;
pub const DWG_OBJECT_TYPE_DWG_TYPE_CONTEXTDATAMANAGER: DWG_OBJECT_TYPE = 615;
pub const DWG_OBJECT_TYPE_DWG_TYPE_CSACDOCUMENTOPTIONS: DWG_OBJECT_TYPE = 616;
pub const DWG_OBJECT_TYPE_DWG_TYPE_CURVEPATH: DWG_OBJECT_TYPE = 617;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DATALINK: DWG_OBJECT_TYPE = 618;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DATATABLE: DWG_OBJECT_TYPE = 619;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DBCOLOR: DWG_OBJECT_TYPE = 620;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DETAILVIEWSTYLE: DWG_OBJECT_TYPE = 621;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DGNDEFINITION: DWG_OBJECT_TYPE = 622;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DGNUNDERLAY: DWG_OBJECT_TYPE = 623;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DICTIONARYVAR: DWG_OBJECT_TYPE = 624;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DICTIONARYWDFLT: DWG_OBJECT_TYPE = 625;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DIMASSOC: DWG_OBJECT_TYPE = 626;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DMDIMOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 627;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DWFDEFINITION: DWG_OBJECT_TYPE = 628;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DWFUNDERLAY: DWG_OBJECT_TYPE = 629;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DYNAMICBLOCKPROXYNODE: DWG_OBJECT_TYPE = 630;
pub const DWG_OBJECT_TYPE_DWG_TYPE_DYNAMICBLOCKPURGEPREVENTER: DWG_OBJECT_TYPE = 631;
pub const DWG_OBJECT_TYPE_DWG_TYPE_EVALUATION_GRAPH: DWG_OBJECT_TYPE = 632;
pub const DWG_OBJECT_TYPE_DWG_TYPE_EXTRUDEDSURFACE: DWG_OBJECT_TYPE = 633;
pub const DWG_OBJECT_TYPE_DWG_TYPE_FCFOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 634;
pub const DWG_OBJECT_TYPE_DWG_TYPE_FIELD: DWG_OBJECT_TYPE = 635;
pub const DWG_OBJECT_TYPE_DWG_TYPE_FIELDLIST: DWG_OBJECT_TYPE = 636;
pub const DWG_OBJECT_TYPE_DWG_TYPE_FLIPPARAMETERENTITY: DWG_OBJECT_TYPE = 637;
pub const DWG_OBJECT_TYPE_DWG_TYPE_GEODATA: DWG_OBJECT_TYPE = 638;
pub const DWG_OBJECT_TYPE_DWG_TYPE_GEOMAPIMAGE: DWG_OBJECT_TYPE = 639;
pub const DWG_OBJECT_TYPE_DWG_TYPE_GEOPOSITIONMARKER: DWG_OBJECT_TYPE = 640;
pub const DWG_OBJECT_TYPE_DWG_TYPE_GRADIENT_BACKGROUND: DWG_OBJECT_TYPE = 641;
pub const DWG_OBJECT_TYPE_DWG_TYPE_GROUND_PLANE_BACKGROUND: DWG_OBJECT_TYPE = 642;
pub const DWG_OBJECT_TYPE_DWG_TYPE_HELIX: DWG_OBJECT_TYPE = 643;
pub const DWG_OBJECT_TYPE_DWG_TYPE_IBL_BACKGROUND: DWG_OBJECT_TYPE = 644;
pub const DWG_OBJECT_TYPE_DWG_TYPE_IDBUFFER: DWG_OBJECT_TYPE = 645;
pub const DWG_OBJECT_TYPE_DWG_TYPE_IMAGE: DWG_OBJECT_TYPE = 646;
pub const DWG_OBJECT_TYPE_DWG_TYPE_IMAGEDEF: DWG_OBJECT_TYPE = 647;
pub const DWG_OBJECT_TYPE_DWG_TYPE_IMAGEDEF_REACTOR: DWG_OBJECT_TYPE = 648;
pub const DWG_OBJECT_TYPE_DWG_TYPE_IMAGE_BACKGROUND: DWG_OBJECT_TYPE = 649;
pub const DWG_OBJECT_TYPE_DWG_TYPE_INDEX: DWG_OBJECT_TYPE = 650;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LARGE_RADIAL_DIMENSION: DWG_OBJECT_TYPE = 651;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LAYERFILTER: DWG_OBJECT_TYPE = 652;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LAYER_INDEX: DWG_OBJECT_TYPE = 653;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LAYOUTPRINTCONFIG: DWG_OBJECT_TYPE = 654;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LEADEROBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 655;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LIGHT: DWG_OBJECT_TYPE = 656;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LIGHTLIST: DWG_OBJECT_TYPE = 657;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LINEARPARAMETERENTITY: DWG_OBJECT_TYPE = 658;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LOFTEDSURFACE: DWG_OBJECT_TYPE = 659;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MATERIAL: DWG_OBJECT_TYPE = 660;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MENTALRAYRENDERSETTINGS: DWG_OBJECT_TYPE = 661;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MESH: DWG_OBJECT_TYPE = 662;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MLEADEROBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 663;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MLEADERSTYLE: DWG_OBJECT_TYPE = 664;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MOTIONPATH: DWG_OBJECT_TYPE = 665;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MPOLYGON: DWG_OBJECT_TYPE = 666;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MTEXTATTRIBUTEOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 667;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MTEXTOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 668;
pub const DWG_OBJECT_TYPE_DWG_TYPE_MULTILEADER: DWG_OBJECT_TYPE = 669;
pub const DWG_OBJECT_TYPE_DWG_TYPE_NAVISWORKSMODEL: DWG_OBJECT_TYPE = 670;
pub const DWG_OBJECT_TYPE_DWG_TYPE_NAVISWORKSMODELDEF: DWG_OBJECT_TYPE = 671;
pub const DWG_OBJECT_TYPE_DWG_TYPE_NPOCOLLECTION: DWG_OBJECT_TYPE = 672;
pub const DWG_OBJECT_TYPE_DWG_TYPE_NURBSURFACE: DWG_OBJECT_TYPE = 673;
pub const DWG_OBJECT_TYPE_DWG_TYPE_OBJECT_PTR: DWG_OBJECT_TYPE = 674;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ORDDIMOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 675;
pub const DWG_OBJECT_TYPE_DWG_TYPE_PARTIAL_VIEWING_INDEX: DWG_OBJECT_TYPE = 676;
pub const DWG_OBJECT_TYPE_DWG_TYPE_PDFDEFINITION: DWG_OBJECT_TYPE = 677;
pub const DWG_OBJECT_TYPE_DWG_TYPE_PDFUNDERLAY: DWG_OBJECT_TYPE = 678;
pub const DWG_OBJECT_TYPE_DWG_TYPE_PERSUBENTMGR: DWG_OBJECT_TYPE = 679;
pub const DWG_OBJECT_TYPE_DWG_TYPE_PLANESURFACE: DWG_OBJECT_TYPE = 680;
pub const DWG_OBJECT_TYPE_DWG_TYPE_PLOTSETTINGS: DWG_OBJECT_TYPE = 681;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINTCLOUD: DWG_OBJECT_TYPE = 682;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINTCLOUDCOLORMAP: DWG_OBJECT_TYPE = 683;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINTCLOUDDEF: DWG_OBJECT_TYPE = 684;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINTCLOUDDEFEX: DWG_OBJECT_TYPE = 685;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINTCLOUDDEF_REACTOR: DWG_OBJECT_TYPE = 686;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINTCLOUDDEF_REACTOR_EX: DWG_OBJECT_TYPE = 687;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINTCLOUDEX: DWG_OBJECT_TYPE = 688;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINTPARAMETERENTITY: DWG_OBJECT_TYPE = 689;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POINTPATH: DWG_OBJECT_TYPE = 690;
pub const DWG_OBJECT_TYPE_DWG_TYPE_POLARGRIPENTITY: DWG_OBJECT_TYPE = 691;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RADIMLGOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 692;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RADIMOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 693;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RAPIDRTRENDERSETTINGS: DWG_OBJECT_TYPE = 694;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RASTERVARIABLES: DWG_OBJECT_TYPE = 695;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RENDERENTRY: DWG_OBJECT_TYPE = 696;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RENDERENVIRONMENT: DWG_OBJECT_TYPE = 697;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RENDERGLOBAL: DWG_OBJECT_TYPE = 698;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RENDERSETTINGS: DWG_OBJECT_TYPE = 699;
pub const DWG_OBJECT_TYPE_DWG_TYPE_REVOLVEDSURFACE: DWG_OBJECT_TYPE = 700;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ROTATIONPARAMETERENTITY: DWG_OBJECT_TYPE = 701;
pub const DWG_OBJECT_TYPE_DWG_TYPE_RTEXT: DWG_OBJECT_TYPE = 702;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SCALE: DWG_OBJECT_TYPE = 703;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SECTIONOBJECT: DWG_OBJECT_TYPE = 704;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SECTIONVIEWSTYLE: DWG_OBJECT_TYPE = 705;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SECTION_MANAGER: DWG_OBJECT_TYPE = 706;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SECTION_SETTINGS: DWG_OBJECT_TYPE = 707;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SKYLIGHT_BACKGROUND: DWG_OBJECT_TYPE = 708;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SOLID_BACKGROUND: DWG_OBJECT_TYPE = 709;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SORTENTSTABLE: DWG_OBJECT_TYPE = 710;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SPATIAL_FILTER: DWG_OBJECT_TYPE = 711;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SPATIAL_INDEX: DWG_OBJECT_TYPE = 712;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SUN: DWG_OBJECT_TYPE = 713;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SUNSTUDY: DWG_OBJECT_TYPE = 714;
pub const DWG_OBJECT_TYPE_DWG_TYPE_SWEPTSURFACE: DWG_OBJECT_TYPE = 715;
pub const DWG_OBJECT_TYPE_DWG_TYPE_TABLE: DWG_OBJECT_TYPE = 716;
pub const DWG_OBJECT_TYPE_DWG_TYPE_TABLECONTENT: DWG_OBJECT_TYPE = 717;
pub const DWG_OBJECT_TYPE_DWG_TYPE_TABLEGEOMETRY: DWG_OBJECT_TYPE = 718;
pub const DWG_OBJECT_TYPE_DWG_TYPE_TABLESTYLE: DWG_OBJECT_TYPE = 719;
pub const DWG_OBJECT_TYPE_DWG_TYPE_TEXTOBJECTCONTEXTDATA: DWG_OBJECT_TYPE = 720;
pub const DWG_OBJECT_TYPE_DWG_TYPE_TVDEVICEPROPERTIES: DWG_OBJECT_TYPE = 721;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VISIBILITYGRIPENTITY: DWG_OBJECT_TYPE = 722;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VISIBILITYPARAMETERENTITY: DWG_OBJECT_TYPE = 723;
pub const DWG_OBJECT_TYPE_DWG_TYPE_VISUALSTYLE: DWG_OBJECT_TYPE = 724;
pub const DWG_OBJECT_TYPE_DWG_TYPE_WIPEOUT: DWG_OBJECT_TYPE = 725;
pub const DWG_OBJECT_TYPE_DWG_TYPE_WIPEOUTVARIABLES: DWG_OBJECT_TYPE = 726;
pub const DWG_OBJECT_TYPE_DWG_TYPE_XREFPANELOBJECT: DWG_OBJECT_TYPE = 727;
pub const DWG_OBJECT_TYPE_DWG_TYPE_XYPARAMETERENTITY: DWG_OBJECT_TYPE = 728;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BREAKDATA: DWG_OBJECT_TYPE = 729;
pub const DWG_OBJECT_TYPE_DWG_TYPE_BREAKPOINTREF: DWG_OBJECT_TYPE = 730;
pub const DWG_OBJECT_TYPE_DWG_TYPE_FLIPGRIPENTITY: DWG_OBJECT_TYPE = 731;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LINEARGRIPENTITY: DWG_OBJECT_TYPE = 732;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ROTATIONGRIPENTITY: DWG_OBJECT_TYPE = 733;
pub const DWG_OBJECT_TYPE_DWG_TYPE_XYGRIPENTITY: DWG_OBJECT_TYPE = 734;
pub const DWG_OBJECT_TYPE_DWG_TYPE__3DLINE: DWG_OBJECT_TYPE = 735;
pub const DWG_OBJECT_TYPE_DWG_TYPE_REPEAT: DWG_OBJECT_TYPE = 736;
pub const DWG_OBJECT_TYPE_DWG_TYPE_ENDREP: DWG_OBJECT_TYPE = 737;
pub const DWG_OBJECT_TYPE_DWG_TYPE_JUMP: DWG_OBJECT_TYPE = 738;
pub const DWG_OBJECT_TYPE_DWG_TYPE_LOAD: DWG_OBJECT_TYPE = 739;
pub const DWG_OBJECT_TYPE_DWG_TYPE_FREED: DWG_OBJECT_TYPE = 65533;
pub const DWG_OBJECT_TYPE_DWG_TYPE_UNKNOWN_ENT: DWG_OBJECT_TYPE = 65534;
pub const DWG_OBJECT_TYPE_DWG_TYPE_UNKNOWN_OBJ: DWG_OBJECT_TYPE = 65535;
#[doc = "Object and Entity types that exist in dwg-files."]
pub type DWG_OBJECT_TYPE = ::std::os::raw::c_int;
#[doc = "Object and Entity types that exist in dwg-files."]
pub use self::DWG_OBJECT_TYPE as Dwg_Object_Type;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_UNUSED_r11: DWG_OBJECT_TYPE_R11 = 0;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_LINE_r11: DWG_OBJECT_TYPE_R11 = 1;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_POINT_r11: DWG_OBJECT_TYPE_R11 = 2;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_CIRCLE_r11: DWG_OBJECT_TYPE_R11 = 3;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_SHAPE_r11: DWG_OBJECT_TYPE_R11 = 4;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_REPEAT_r11: DWG_OBJECT_TYPE_R11 = 5;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_ENDREP_r11: DWG_OBJECT_TYPE_R11 = 6;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_TEXT_r11: DWG_OBJECT_TYPE_R11 = 7;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_ARC_r11: DWG_OBJECT_TYPE_R11 = 8;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_TRACE_r11: DWG_OBJECT_TYPE_R11 = 9;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_LOAD_r11: DWG_OBJECT_TYPE_R11 = 10;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_SOLID_r11: DWG_OBJECT_TYPE_R11 = 11;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_BLOCK_r11: DWG_OBJECT_TYPE_R11 = 12;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_ENDBLK_r11: DWG_OBJECT_TYPE_R11 = 13;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_INSERT_r11: DWG_OBJECT_TYPE_R11 = 14;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_ATTDEF_r11: DWG_OBJECT_TYPE_R11 = 15;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_ATTRIB_r11: DWG_OBJECT_TYPE_R11 = 16;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_SEQEND_r11: DWG_OBJECT_TYPE_R11 = 17;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_JUMP_r11: DWG_OBJECT_TYPE_R11 = 18;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_POLYLINE_r11: DWG_OBJECT_TYPE_R11 = 19;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_VERTEX_r11: DWG_OBJECT_TYPE_R11 = 20;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_3DLINE_r11: DWG_OBJECT_TYPE_R11 = 21;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_3DFACE_r11: DWG_OBJECT_TYPE_R11 = 22;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_DIMENSION_r11: DWG_OBJECT_TYPE_R11 = 23;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_VIEWPORT_r11: DWG_OBJECT_TYPE_R11 = 24;
pub const DWG_OBJECT_TYPE_R11_DWG_TYPE_UNKNOWN_r11: DWG_OBJECT_TYPE_R11 = 25;
pub type DWG_OBJECT_TYPE_R11 = ::std::os::raw::c_int;
pub use self::DWG_OBJECT_TYPE_R11 as Dwg_Object_Type_r11;
pub const DWG_ERROR_DWG_NOERR: DWG_ERROR = 0;
pub const DWG_ERROR_DWG_ERR_WRONGCRC: DWG_ERROR = 1;
pub const DWG_ERROR_DWG_ERR_NOTYETSUPPORTED: DWG_ERROR = 2;
pub const DWG_ERROR_DWG_ERR_UNHANDLEDCLASS: DWG_ERROR = 4;
pub const DWG_ERROR_DWG_ERR_INVALIDTYPE: DWG_ERROR = 8;
pub const DWG_ERROR_DWG_ERR_INVALIDHANDLE: DWG_ERROR = 16;
pub const DWG_ERROR_DWG_ERR_INVALIDEED: DWG_ERROR = 32;
pub const DWG_ERROR_DWG_ERR_VALUEOUTOFBOUNDS: DWG_ERROR = 64;
pub const DWG_ERROR_DWG_ERR_CLASSESNOTFOUND: DWG_ERROR = 128;
pub const DWG_ERROR_DWG_ERR_SECTIONNOTFOUND: DWG_ERROR = 256;
pub const DWG_ERROR_DWG_ERR_PAGENOTFOUND: DWG_ERROR = 512;
pub const DWG_ERROR_DWG_ERR_INTERNALERROR: DWG_ERROR = 1024;
pub const DWG_ERROR_DWG_ERR_INVALIDDWG: DWG_ERROR = 2048;
pub const DWG_ERROR_DWG_ERR_IOERROR: DWG_ERROR = 4096;
pub const DWG_ERROR_DWG_ERR_OUTOFMEM: DWG_ERROR = 8192;
#[doc = "Error codes returned."]
pub type DWG_ERROR = ::std::os::raw::c_int;
#[doc = "Error codes returned."]
pub use self::DWG_ERROR as Dwg_Error;
#[doc = "handles resolve absolute or relative indices to objects.\n\ncode 2-5: represents the type of the relation: hard/soft, owner/id.\n\ncode TYPEDOBJHANDLE:\n2 Soft owner,\n3 Hard owner,\n4 Soft pointer,\n5 Hard pointer\n\ncode > 6: the handle is stored as an offset from some other handle.\n\ncode OFFSETOBJHANDLE for soft owners or pointers:\n6 ref + 1,\n8 ref - 1,\na ref + offset,\nc ref - offset\n\nSee \\ref Dwg_Handle"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_handle {
    #[doc = "< OFFSETOBJHANDLE if > 6"]
    pub code: BITCODE_RC,
    pub size: BITCODE_RC,
    pub value: BITCODE_RLL,
    pub is_global: BITCODE_B,
}
#[test]
fn bindgen_test_layout__dwg_handle() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_handle> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_handle>(),
        24usize,
        concat!("Size of: ", stringify!(_dwg_handle))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_handle>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_handle))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_handle),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_handle),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_handle),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_global) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_handle),
            "::",
            stringify!(is_global)
        )
    );
}
#[doc = "handles resolve absolute or relative indices to objects.\n\ncode 2-5: represents the type of the relation: hard/soft, owner/id.\n\ncode TYPEDOBJHANDLE:\n2 Soft owner,\n3 Hard owner,\n4 Soft pointer,\n5 Hard pointer\n\ncode > 6: the handle is stored as an offset from some other handle.\n\ncode OFFSETOBJHANDLE for soft owners or pointers:\n6 ref + 1,\n8 ref - 1,\na ref + offset,\nc ref - offset\n\nSee \\ref Dwg_Handle"]
pub type Dwg_Handle = _dwg_handle;
#[doc = "object references: obj is resolved by handleref (e.g. via\ndwg_resolve_handleref) when reading a DWG to the respective \\ref\nDwg_Object, and absolute_ref is resolved to the global\n_dwg_struct::object_ref index. It is the same as the hex number in the\nDXF handles.\n\nUsed as \\ref Dwg_Object_Ref"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_object_ref {
    pub obj: *mut _dwg_object,
    pub handleref: Dwg_Handle,
    pub absolute_ref: BITCODE_RLL,
    pub r11_idx: BITCODE_RSd,
}
#[test]
fn bindgen_test_layout__dwg_object_ref() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_object_ref> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_object_ref>(),
        48usize,
        concat!("Size of: ", stringify!(_dwg_object_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_object_ref>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_object_ref))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).obj) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_object_ref),
            "::",
            stringify!(obj)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handleref) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_object_ref),
            "::",
            stringify!(handleref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absolute_ref) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_object_ref),
            "::",
            stringify!(absolute_ref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r11_idx) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_object_ref),
            "::",
            stringify!(r11_idx)
        )
    );
}
#[doc = "object references: obj is resolved by handleref (e.g. via\ndwg_resolve_handleref) when reading a DWG to the respective \\ref\nDwg_Object, and absolute_ref is resolved to the global\n_dwg_struct::object_ref index. It is the same as the hex number in the\nDXF handles.\n\nUsed as \\ref Dwg_Object_Ref"]
pub type Dwg_Object_Ref = _dwg_object_ref;
pub type BITCODE_H = *mut Dwg_Object_Ref;
pub const DWG_HDL_CODE_DWG_HDL_OWNER: DWG_HDL_CODE = 0;
pub const DWG_HDL_CODE_DWG_HDL_SOFTOWN: DWG_HDL_CODE = 2;
pub const DWG_HDL_CODE_DWG_HDL_HARDOWN: DWG_HDL_CODE = 3;
pub const DWG_HDL_CODE_DWG_HDL_SOFTPTR: DWG_HDL_CODE = 4;
pub const DWG_HDL_CODE_DWG_HDL_HARDPTR: DWG_HDL_CODE = 5;
pub type DWG_HDL_CODE = ::std::os::raw::c_int;
pub use self::DWG_HDL_CODE as Dwg_Hdl_Code;
#[doc = "CMC or ENC colors: color index or rgb value. layers are off when the index\nis negative.\nUsed as \\ref Dwg_Color"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_color {
    pub index: BITCODE_BSd,
    pub flag: BITCODE_BS,
    pub raw: BITCODE_BS,
    pub rgb: BITCODE_BL,
    pub method: ::std::os::raw::c_uint,
    pub name: BITCODE_TV,
    pub book_name: BITCODE_TV,
    pub handle: BITCODE_H,
    pub alpha_raw: BITCODE_BL,
    pub alpha_type: BITCODE_BB,
    pub alpha: BITCODE_RC,
}
#[test]
fn bindgen_test_layout__dwg_color() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_color> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_color>(),
        48usize,
        concat!("Size of: ", stringify!(_dwg_color))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_color>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_color))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).raw) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rgb) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(rgb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).book_name) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(book_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha_raw) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(alpha_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha_type) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(alpha_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_color),
            "::",
            stringify!(alpha)
        )
    );
}
#[doc = "CMC or ENC colors: color index or rgb value. layers are off when the index\nis negative.\nUsed as \\ref Dwg_Color"]
pub type Dwg_Color = _dwg_color;
#[doc = "CMC or ENC colors: color index or rgb value. layers are off when the index\nis negative.\nUsed as \\ref Dwg_Color"]
pub type BITCODE_CMC = Dwg_Color;
#[doc = "CMC or ENC colors: color index or rgb value. layers are off when the index\nis negative.\nUsed as \\ref Dwg_Color"]
pub type BITCODE_CMTC = Dwg_Color;
#[doc = "CMC or ENC colors: color index or rgb value. layers are off when the index\nis negative.\nUsed as \\ref Dwg_Color"]
pub type BITCODE_ENC = Dwg_Color;
extern "C" {
    pub fn dwg_color_method_name(method: ::std::os::raw::c_uint) -> *const ::std::os::raw::c_char;
}
#[doc = "ASCII or Unicode text in xdata \\ref Dwg_Resbuf"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _dwg_binary_chunk {
    pub size: ::std::os::raw::c_ushort,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub u: _dwg_binary_chunk__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _dwg_binary_chunk__bindgen_ty_1 {
    pub data: *mut ::std::os::raw::c_char,
    pub wdata: *mut dwg_wchar_t,
}
#[test]
fn bindgen_test_layout__dwg_binary_chunk__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_binary_chunk__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_binary_chunk__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(_dwg_binary_chunk__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_binary_chunk__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_binary_chunk__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_binary_chunk__bindgen_ty_1),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_binary_chunk__bindgen_ty_1),
            "::",
            stringify!(wdata)
        )
    );
}
#[test]
fn bindgen_test_layout__dwg_binary_chunk() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_binary_chunk> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_binary_chunk>(),
        16usize,
        concat!("Size of: ", stringify!(_dwg_binary_chunk))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_binary_chunk>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_binary_chunk))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_binary_chunk),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_binary_chunk),
            "::",
            stringify!(u)
        )
    );
}
impl _dwg_binary_chunk {
    #[inline]
    pub fn codepage(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set_codepage(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub fn is_tu(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_tu(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        codepage: ::std::os::raw::c_uint,
        is_tu: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 15u8, {
            let codepage: u32 = unsafe { ::std::mem::transmute(codepage) };
            codepage as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let is_tu: u32 = unsafe { ::std::mem::transmute(is_tu) };
            is_tu as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "result buffers: xdata linked list of dxf group - value pairs.\nUsed as \\ref Dwg_Resbuf"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _dwg_resbuf {
    pub type_: ::std::os::raw::c_short,
    pub value: _dwg_resbuf__bindgen_ty_1,
    pub nextrb: *mut _dwg_resbuf,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _dwg_resbuf__bindgen_ty_1 {
    pub pt: [f64; 3usize],
    pub i8_: ::std::os::raw::c_char,
    pub i16_: ::std::os::raw::c_short,
    pub i32_: ::std::os::raw::c_int,
    pub i64_: BITCODE_BLL,
    pub absref: BITCODE_RLL,
    pub dbl: f64,
    pub str_: _dwg_binary_chunk,
}
#[test]
fn bindgen_test_layout__dwg_resbuf__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_resbuf__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_resbuf__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(_dwg_resbuf__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_resbuf__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_resbuf__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf__bindgen_ty_1),
            "::",
            stringify!(pt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i8_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf__bindgen_ty_1),
            "::",
            stringify!(i8_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i16_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf__bindgen_ty_1),
            "::",
            stringify!(i16_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf__bindgen_ty_1),
            "::",
            stringify!(i32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i64_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf__bindgen_ty_1),
            "::",
            stringify!(i64_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absref) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf__bindgen_ty_1),
            "::",
            stringify!(absref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf__bindgen_ty_1),
            "::",
            stringify!(dbl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf__bindgen_ty_1),
            "::",
            stringify!(str_)
        )
    );
}
#[test]
fn bindgen_test_layout__dwg_resbuf() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_resbuf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_resbuf>(),
        40usize,
        concat!("Size of: ", stringify!(_dwg_resbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_resbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_resbuf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nextrb) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_resbuf),
            "::",
            stringify!(nextrb)
        )
    );
}
#[doc = "result buffers: xdata linked list of dxf group - value pairs.\nUsed as \\ref Dwg_Resbuf"]
pub type Dwg_Resbuf = _dwg_resbuf;
#[doc = "\\struct Dwg_Header_Variables\nDWG header variables for all versions.\nIf uppercase related to the DXF HEADER $ name.\n\n\\ref _dwg_header_variables"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_header_variables {
    pub size: BITCODE_RL,
    #[doc = "< r2010+"]
    pub bitsize_hi: BITCODE_RL,
    pub bitsize: BITCODE_RL,
    #[doc = "< r13+"]
    pub ACADMAINTVER: BITCODE_RC,
    #[doc = "< r2013+"]
    pub REQUIREDVERSIONS: BITCODE_BLL,
    #[doc = "< DXF 3, r11+"]
    pub DWGCODEPAGE: BITCODE_TV,
    #[doc = "< <r11"]
    pub codepage: BITCODE_RS,
    pub unit1_ratio: BITCODE_BD,
    pub unit2_ratio: BITCODE_BD,
    pub unit3_ratio: BITCODE_BD,
    pub unit4_ratio: BITCODE_BD,
    pub unit1_name: BITCODE_TV,
    pub unit2_name: BITCODE_TV,
    pub unit3_name: BITCODE_TV,
    pub unit4_name: BITCODE_TV,
    pub unknown_8: BITCODE_BL,
    pub unknown_9: BITCODE_BL,
    pub unknown_10: BITCODE_BS,
    #[doc = "< r11-r2000 code 5, no DXF"]
    pub VX_TABLE_RECORD: BITCODE_H,
    pub DIMASO: BITCODE_B,
    pub DIMSHO: BITCODE_B,
    pub DIMSAV: BITCODE_B,
    pub PLINEGEN: BITCODE_B,
    pub ORTHOMODE: BITCODE_B,
    pub REGENMODE: BITCODE_B,
    pub FILLMODE: BITCODE_B,
    pub QTEXTMODE: BITCODE_B,
    pub PSLTSCALE: BITCODE_B,
    pub LIMCHECK: BITCODE_B,
    pub MENUEXT: [BITCODE_RC; 46usize],
    pub BLIPMODE: BITCODE_B,
    pub unknown_11: BITCODE_B,
    pub USRTIMER: BITCODE_B,
    pub FASTZOOM: BITCODE_B,
    pub FLATLAND: BITCODE_B,
    pub VIEWMODE: BITCODE_B,
    pub SKPOLY: BITCODE_B,
    pub unknown_mon: BITCODE_RS,
    pub unknown_day: BITCODE_RS,
    pub unknown_year: BITCODE_RS,
    pub unknown_hour: BITCODE_RS,
    pub unknown_min: BITCODE_RS,
    pub unknown_sec: BITCODE_RS,
    pub unknown_ms: BITCODE_RS,
    pub ANGDIR: BITCODE_B,
    pub SPLFRAME: BITCODE_B,
    pub ATTREQ: BITCODE_B,
    pub ATTDIA: BITCODE_B,
    pub MIRRTEXT: BITCODE_B,
    pub WORLDVIEW: BITCODE_B,
    pub WIREFRAME: BITCODE_B,
    pub TILEMODE: BITCODE_B,
    pub PLIMCHECK: BITCODE_B,
    pub VISRETAIN: BITCODE_B,
    pub DELOBJ: BITCODE_B,
    pub DISPSILH: BITCODE_B,
    pub PELLIPSE: BITCODE_B,
    pub SAVEIMAGES: BITCODE_BS,
    pub PROXYGRAPHICS: BITCODE_BS,
    pub MEASUREMENT: BITCODE_BS,
    pub DRAGMODE: BITCODE_BS,
    pub TREEDEPTH: BITCODE_BSd,
    pub LUNITS: BITCODE_BS,
    pub LUPREC: BITCODE_BS,
    pub AUNITS: BITCODE_BS,
    pub AUPREC: BITCODE_BS,
    pub ATTMODE: BITCODE_BS,
    pub COORDS: BITCODE_BS,
    pub PDMODE: BITCODE_BS,
    pub PICKSTYLE: BITCODE_BS,
    pub OSMODE: BITCODE_BS,
    pub unknown_12: BITCODE_BL,
    pub unknown_13: BITCODE_BL,
    pub unknown_14: BITCODE_BL,
    pub USERI1: BITCODE_BSd,
    pub USERI2: BITCODE_BSd,
    pub USERI3: BITCODE_BSd,
    pub USERI4: BITCODE_BSd,
    pub USERI5: BITCODE_BSd,
    pub SPLINESEGS: BITCODE_BS,
    pub SURFU: BITCODE_BS,
    pub SURFV: BITCODE_BS,
    pub SURFTYPE: BITCODE_BS,
    pub SURFTAB1: BITCODE_BS,
    pub SURFTAB2: BITCODE_BS,
    pub SPLINETYPE: BITCODE_BS,
    pub SHADEDGE: BITCODE_BS,
    pub SHADEDIF: BITCODE_BS,
    pub UNITMODE: BITCODE_BS,
    pub MAXACTVP: BITCODE_BS,
    pub ISOLINES: BITCODE_BS,
    pub CMLJUST: BITCODE_BS,
    pub TEXTQLTY: BITCODE_BS,
    pub unknown_14b: BITCODE_BL,
    pub LTSCALE: BITCODE_BD,
    pub TEXTSIZE: BITCODE_BD,
    pub TRACEWID: BITCODE_BD,
    pub SKETCHINC: BITCODE_BD,
    pub FILLETRAD: BITCODE_BD,
    pub THICKNESS: BITCODE_BD,
    pub ANGBASE: BITCODE_BD,
    pub PDSIZE: BITCODE_BD,
    pub PLINEWID: BITCODE_BD,
    pub USERR1: BITCODE_BD,
    pub USERR2: BITCODE_BD,
    pub USERR3: BITCODE_BD,
    pub USERR4: BITCODE_BD,
    pub USERR5: BITCODE_BD,
    pub CHAMFERA: BITCODE_BD,
    pub CHAMFERB: BITCODE_BD,
    pub CHAMFERC: BITCODE_BD,
    pub CHAMFERD: BITCODE_BD,
    pub FACETRES: BITCODE_BD,
    pub CMLSCALE: BITCODE_BD,
    pub CELTSCALE: BITCODE_BD,
    pub VIEWTWIST: BITCODE_BD,
    pub MENU: BITCODE_TV,
    pub TDCREATE: BITCODE_TIMEBLL,
    pub TDUPDATE: BITCODE_TIMEBLL,
    pub TDUCREATE: BITCODE_TIMEBLL,
    pub TDUUPDATE: BITCODE_TIMEBLL,
    pub unknown_15: BITCODE_BL,
    pub unknown_16: BITCODE_BL,
    pub unknown_17: BITCODE_BL,
    pub TDINDWG: BITCODE_TIMEBLL,
    pub TDUSRTIMER: BITCODE_TIMEBLL,
    pub CECOLOR: BITCODE_CMC,
    pub HANDLING: BITCODE_BS,
    pub HANDSEED: BITCODE_H,
    pub unknown_4f2: BITCODE_RL,
    pub unknown_5: BITCODE_RS,
    pub unknown_6: BITCODE_RS,
    pub unknown_6a: BITCODE_RS,
    pub unknown_6b: BITCODE_RS,
    pub unknown_6c: BITCODE_RS,
    #[doc = "< code 5, DXF 8"]
    pub CLAYER: BITCODE_H,
    #[doc = "< code 5, DXF 7"]
    pub TEXTSTYLE: BITCODE_H,
    #[doc = "< code 5, DXF 6"]
    pub CELTYPE: BITCODE_H,
    #[doc = "< r2007+ code 5, no DXF"]
    pub CMATERIAL: BITCODE_H,
    #[doc = "< code 5, DXF 2"]
    pub DIMSTYLE: BITCODE_H,
    #[doc = "< code 5, DXF 2"]
    pub CMLSTYLE: BITCODE_H,
    pub PSVPSCALE: BITCODE_BD,
    #[doc = "< r13+ ..."]
    pub PINSBASE: BITCODE_3BD,
    pub PEXTMIN: BITCODE_3BD,
    pub PEXTMAX: BITCODE_3BD,
    pub PLIMMIN: BITCODE_2DPOINT,
    pub PLIMMAX: BITCODE_2DPOINT,
    pub PELEVATION: BITCODE_BD,
    pub PUCSORG: BITCODE_3BD,
    pub PUCSXDIR: BITCODE_3BD,
    pub PUCSYDIR: BITCODE_3BD,
    #[doc = "< r13+ code 5, DXF 2"]
    pub PUCSNAME: BITCODE_H,
    #[doc = "< r2000+ code 5, DXF 2"]
    pub PUCSBASE: BITCODE_H,
    #[doc = "< r2000+ code 5, DXF 2"]
    pub PUCSORTHOREF: BITCODE_H,
    pub PUCSORTHOVIEW: BITCODE_BS,
    pub PUCSORGTOP: BITCODE_3BD,
    pub PUCSORGBOTTOM: BITCODE_3BD,
    pub PUCSORGLEFT: BITCODE_3BD,
    pub PUCSORGRIGHT: BITCODE_3BD,
    pub PUCSORGFRONT: BITCODE_3BD,
    pub PUCSORGBACK: BITCODE_3BD,
    pub INSBASE: BITCODE_3BD,
    pub EXTMIN: BITCODE_3BD,
    pub EXTMAX: BITCODE_3BD,
    pub VIEWDIR: BITCODE_3BD,
    pub TARGET: BITCODE_3BD,
    pub LIMMIN: BITCODE_2DPOINT,
    pub LIMMAX: BITCODE_2DPOINT,
    pub VIEWCTR: BITCODE_3RD,
    pub ELEVATION: BITCODE_BD,
    pub VIEWSIZE: BITCODE_RD,
    pub SNAPMODE: BITCODE_RS,
    pub SNAPUNIT: BITCODE_2RD,
    pub SNAPBASE: BITCODE_2RD,
    pub SNAPANG: BITCODE_RD,
    pub SNAPSTYLE: BITCODE_RS,
    pub SNAPISOPAIR: BITCODE_RS,
    pub GRIDMODE: BITCODE_RS,
    pub GRIDUNIT: BITCODE_2RD,
    pub AXISMODE: BITCODE_BS,
    pub AXISUNIT: BITCODE_2RD,
    pub VPOINTX: BITCODE_3RD,
    pub VPOINTY: BITCODE_3RD,
    pub VPOINTZ: BITCODE_3RD,
    pub VPOINTXALT: BITCODE_3RD,
    pub VPOINTYALT: BITCODE_3RD,
    pub VPOINTZALT: BITCODE_3RD,
    pub flag_3d: BITCODE_RS,
    pub UCSORG: BITCODE_3BD,
    pub UCSXDIR: BITCODE_3BD,
    pub UCSYDIR: BITCODE_3BD,
    #[doc = "< code 5, DXF 2"]
    pub UCSNAME: BITCODE_H,
    #[doc = "< code 5, DXF 2"]
    pub UCSBASE: BITCODE_H,
    pub UCSORTHOVIEW: BITCODE_BS,
    #[doc = "< code 5, DXF 2"]
    pub UCSORTHOREF: BITCODE_H,
    pub UCSORGTOP: BITCODE_3BD,
    pub UCSORGBOTTOM: BITCODE_3BD,
    pub UCSORGLEFT: BITCODE_3BD,
    pub UCSORGRIGHT: BITCODE_3BD,
    pub UCSORGFRONT: BITCODE_3BD,
    pub UCSORGBACK: BITCODE_3BD,
    pub DIMPOST: BITCODE_TV,
    pub DIMAPOST: BITCODE_TV,
    pub DIMTOL: BITCODE_B,
    pub DIMLIM: BITCODE_B,
    pub DIMTIH: BITCODE_B,
    pub DIMTOH: BITCODE_B,
    pub DIMSE1: BITCODE_B,
    pub DIMSE2: BITCODE_B,
    pub DIMALT: BITCODE_B,
    pub DIMTOFL: BITCODE_B,
    pub DIMSAH: BITCODE_B,
    pub DIMTIX: BITCODE_B,
    pub DIMSOXD: BITCODE_B,
    #[doc = "< r13-r14 only RC"]
    pub DIMALTD: BITCODE_BS,
    #[doc = "< r13-r14 only RC"]
    pub DIMZIN: BITCODE_BS,
    pub DIMSD1: BITCODE_B,
    pub DIMSD2: BITCODE_B,
    #[doc = "< r13-r14 only RC"]
    pub DIMTOLJ: BITCODE_BS,
    #[doc = "< r13-r14 only RC"]
    pub DIMJUST: BITCODE_BS,
    #[doc = "< r13-r14 only RC"]
    pub DIMFIT: BITCODE_BS,
    pub DIMUPT: BITCODE_B,
    #[doc = "< r13-r14 only RC"]
    pub DIMTZIN: BITCODE_BS,
    #[doc = "< r13-r14 only RC"]
    pub DIMTAD: BITCODE_BS,
    pub DIMUNIT: BITCODE_BS,
    pub DIMAUNIT: BITCODE_BS,
    pub DIMDEC: BITCODE_BS,
    pub DIMTDEC: BITCODE_BS,
    pub DIMALTU: BITCODE_BS,
    pub DIMALTTD: BITCODE_BS,
    #[doc = "< code 5, DXF 7"]
    pub DIMTXSTY: BITCODE_H,
    pub DIMSCALE: BITCODE_BD,
    pub DIMARROW: BITCODE_BD,
    pub DIMASZ: BITCODE_BD,
    pub DIMEXO: BITCODE_BD,
    pub DIMDLI: BITCODE_BD,
    pub DIMEXE: BITCODE_BD,
    pub DIMRND: BITCODE_BD,
    pub DIMDLE: BITCODE_BD,
    pub DIMTP: BITCODE_BD,
    pub DIMTM: BITCODE_BD,
    pub DIMFXL: BITCODE_BD,
    pub DIMJOGANG: BITCODE_BD,
    pub DIMTFILL: BITCODE_BS,
    pub DIMTFILLCLR: BITCODE_CMC,
    pub DIMAZIN: BITCODE_BS,
    pub DIMARCSYM: BITCODE_BS,
    pub DIMTXT: BITCODE_BD,
    pub DIMCEN: BITCODE_BD,
    pub DIMTSZ: BITCODE_BD,
    pub DIMALTF: BITCODE_BD,
    pub DIMLFAC: BITCODE_BD,
    pub DIMTVP: BITCODE_BD,
    pub DIMTFAC: BITCODE_BD,
    pub DIMGAP: BITCODE_BD,
    pub DIMPOST_T: BITCODE_TV,
    pub DIMAPOST_T: BITCODE_TV,
    pub DIMBLK_T: BITCODE_TV,
    pub DIMBLK1_T: BITCODE_TV,
    pub DIMBLK2_T: BITCODE_TV,
    pub unknown_string: BITCODE_TV,
    pub DIMALTRND: BITCODE_BD,
    pub DIMCLRD_C: BITCODE_RS,
    pub DIMCLRE_C: BITCODE_RS,
    pub DIMCLRT_C: BITCODE_RS,
    pub DIMCLRD: BITCODE_CMC,
    pub DIMCLRE: BITCODE_CMC,
    pub DIMCLRT: BITCODE_CMC,
    #[doc = "< r2000+ ..."]
    pub DIMADEC: BITCODE_BS,
    pub DIMFRAC: BITCODE_BS,
    pub DIMLUNIT: BITCODE_BS,
    pub DIMDSEP: BITCODE_BS,
    pub DIMTMOVE: BITCODE_BS,
    #[doc = "< r13-r14 only RC"]
    pub DIMALTZ: BITCODE_BS,
    #[doc = "< r13-r14 only RC"]
    pub DIMALTTZ: BITCODE_BS,
    pub DIMATFIT: BITCODE_BS,
    #[doc = "< r2007+"]
    pub DIMFXLON: BITCODE_B,
    #[doc = "< r2010+"]
    pub DIMTXTDIRECTION: BITCODE_B,
    #[doc = "< r2010+"]
    pub DIMALTMZF: BITCODE_BD,
    #[doc = "< r2010+"]
    pub DIMALTMZS: BITCODE_TV,
    #[doc = "< r2010+"]
    pub DIMMZF: BITCODE_BD,
    #[doc = "< r2010+"]
    pub DIMMZS: BITCODE_TV,
    #[doc = "< r2000+ code 5, DXF 1"]
    pub DIMLDRBLK: BITCODE_H,
    #[doc = "< r2000+ code 5, DXF 1"]
    pub DIMBLK: BITCODE_H,
    #[doc = "< r2000+ code 5, DXF 1"]
    pub DIMBLK1: BITCODE_H,
    #[doc = "< r2000+ code 5, DXF 1"]
    pub DIMBLK2: BITCODE_H,
    #[doc = "< r2007+ code 5, DXF 6"]
    pub DIMLTYPE: BITCODE_H,
    #[doc = "< r2007+ code 5, DXF 6"]
    pub DIMLTEX1: BITCODE_H,
    #[doc = "< r2007+ code 5, DXF 6"]
    pub DIMLTEX2: BITCODE_H,
    #[doc = "< r2000+"]
    pub DIMLWD: BITCODE_BSd,
    #[doc = "< r2000+"]
    pub DIMLWE: BITCODE_BSd,
    #[doc = "< code 3"]
    pub BLOCK_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< code 3"]
    pub LAYER_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< code 3"]
    pub STYLE_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< code 3"]
    pub LTYPE_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< code 3"]
    pub VIEW_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< code 3"]
    pub UCS_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< code 3"]
    pub VPORT_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< code 3"]
    pub APPID_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< code 3"]
    pub DIMSTYLE_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< r11-r2000 code 3"]
    pub VX_CONTROL_OBJECT: BITCODE_H,
    #[doc = "< code 5"]
    pub DICTIONARY_ACAD_GROUP: BITCODE_H,
    #[doc = "< code 5"]
    pub DICTIONARY_ACAD_MLINESTYLE: BITCODE_H,
    #[doc = "< code 5, the \"NOD\""]
    pub DICTIONARY_NAMED_OBJECT: BITCODE_H,
    #[doc = "< r2000+"]
    pub TSTACKALIGN: BITCODE_BS,
    #[doc = "< r2000+"]
    pub TSTACKSIZE: BITCODE_BS,
    #[doc = "< r2000+"]
    pub HYPERLINKBASE: BITCODE_TV,
    #[doc = "< r2000+"]
    pub STYLESHEET: BITCODE_TV,
    #[doc = "< r2000+ code 5"]
    pub DICTIONARY_LAYOUT: BITCODE_H,
    #[doc = "< r2000+ code 5"]
    pub DICTIONARY_PLOTSETTINGS: BITCODE_H,
    #[doc = "< r2000+ code 5"]
    pub DICTIONARY_PLOTSTYLENAME: BITCODE_H,
    #[doc = "< r2004+ code 5"]
    pub DICTIONARY_MATERIAL: BITCODE_H,
    #[doc = "< r2004+ code 5"]
    pub DICTIONARY_COLOR: BITCODE_H,
    #[doc = "< r2007+ code 5"]
    pub DICTIONARY_VISUALSTYLE: BITCODE_H,
    #[doc = "< r2010+ code 5 ??"]
    pub DICTIONARY_LIGHTLIST: BITCODE_H,
    #[doc = "< r2013+ code 5 LIGHTLIST?"]
    pub unknown_20: BITCODE_H,
    pub FLAGS: BITCODE_BL,
    #[doc = "< = FLAGS & 0x1f, see dxf_cvt_lweight() DXF 370 (int16)"]
    pub CELWEIGHT: BITCODE_BSd,
    #[doc = "< = FLAGS & 0x60"]
    pub ENDCAPS: BITCODE_B,
    #[doc = "< = FLAGS & 0x180"]
    pub JOINSTYLE: BITCODE_B,
    #[doc = "< = !(FLAGS & 0x200)"]
    pub LWDISPLAY: BITCODE_B,
    #[doc = "< = !(FLAGS & 0x400)"]
    pub XEDIT: BITCODE_B,
    #[doc = "< = FLAGS & 0x800"]
    pub EXTNAMES: BITCODE_B,
    #[doc = "< = FLAGS & 0x2000"]
    pub PSTYLEMODE: BITCODE_B,
    #[doc = "< = FLAGS & 0x4000"]
    pub OLESTARTUP: BITCODE_B,
    pub INSUNITS: BITCODE_BS,
    pub CEPSNTYPE: BITCODE_BS,
    #[doc = "< when CEPSNTYPE = 3, code 5"]
    pub CPSNID: BITCODE_H,
    pub FINGERPRINTGUID: BITCODE_TV,
    pub VERSIONGUID: BITCODE_TV,
    pub SORTENTS: BITCODE_RC,
    pub INDEXCTL: BITCODE_RC,
    pub HIDETEXT: BITCODE_RC,
    pub XCLIPFRAME: BITCODE_RC,
    pub DIMASSOC: BITCODE_RC,
    pub HALOGAP: BITCODE_RC,
    pub OBSCOLOR: BITCODE_BS,
    pub INTERSECTIONCOLOR: BITCODE_BS,
    pub OBSLTYPE: BITCODE_RC,
    pub INTERSECTIONDISPLAY: BITCODE_RC,
    pub PROJECTNAME: BITCODE_TV,
    #[doc = "< code 5"]
    pub BLOCK_RECORD_PSPACE: BITCODE_H,
    #[doc = "< code 5"]
    pub BLOCK_RECORD_MSPACE: BITCODE_H,
    #[doc = "< code 5"]
    pub LTYPE_BYLAYER: BITCODE_H,
    #[doc = "< code 5"]
    pub LTYPE_BYBLOCK: BITCODE_H,
    #[doc = "< code 5"]
    pub LTYPE_CONTINUOUS: BITCODE_H,
    #[doc = "< r2007+ ..."]
    pub CAMERADISPLAY: BITCODE_B,
    pub unknown_21: BITCODE_BL,
    pub unknown_22: BITCODE_BL,
    pub unknown_23: BITCODE_BD,
    pub STEPSPERSEC: BITCODE_BD,
    pub STEPSIZE: BITCODE_BD,
    pub _3DDWFPREC: BITCODE_BD,
    pub LENSLENGTH: BITCODE_BD,
    pub CAMERAHEIGHT: BITCODE_BD,
    pub SOLIDHIST: BITCODE_RC,
    pub SHOWHIST: BITCODE_RC,
    pub PSOLWIDTH: BITCODE_BD,
    pub PSOLHEIGHT: BITCODE_BD,
    pub LOFTANG1: BITCODE_BD,
    pub LOFTANG2: BITCODE_BD,
    pub LOFTMAG1: BITCODE_BD,
    pub LOFTMAG2: BITCODE_BD,
    pub LOFTPARAM: BITCODE_BS,
    pub LOFTNORMALS: BITCODE_RC,
    pub LATITUDE: BITCODE_BD,
    pub LONGITUDE: BITCODE_BD,
    pub NORTHDIRECTION: BITCODE_BD,
    pub TIMEZONE: BITCODE_BL,
    pub LIGHTGLYPHDISPLAY: BITCODE_RC,
    pub TILEMODELIGHTSYNCH: BITCODE_RC,
    pub DWFFRAME: BITCODE_RC,
    pub DGNFRAME: BITCODE_RC,
    pub REALWORLDSCALE: BITCODE_B,
    pub INTERFERECOLOR: BITCODE_CMC,
    #[doc = "< r2007+ code 5, DXF 345 VISUALSTYLE"]
    pub INTERFEREOBJVS: BITCODE_H,
    #[doc = "< r2007+ code 5, DXF 346 VISUALSTYLE"]
    pub INTERFEREVPVS: BITCODE_H,
    #[doc = "< r2007+ code 5, DXF 349 VISUALSTYLE"]
    pub DRAGVS: BITCODE_H,
    pub CSHADOW: BITCODE_RC,
    pub SHADOWPLANELOCATION: BITCODE_BD,
    #[doc = "< r14+ ... optional"]
    pub unknown_54: BITCODE_BS,
    pub unknown_55: BITCODE_BS,
    pub unknown_56: BITCODE_BS,
    pub unknown_57: BITCODE_BS,
    pub dwg_size: BITCODE_RL,
    pub numentities: BITCODE_RS,
    pub circle_zoom_percent: BITCODE_RS,
    pub FRONTZ: BITCODE_BD,
    pub BACKZ: BITCODE_BD,
    pub UCSICON: BITCODE_RC,
    pub oldCECOLOR_hi: BITCODE_RL,
    pub oldCECOLOR_lo: BITCODE_RL,
    pub layer_colors: [BITCODE_RS; 128usize],
    pub unknown_51e: BITCODE_RS,
    pub unknown_520: BITCODE_RS,
    pub unknown_52c: BITCODE_RSd,
    pub unknown_52e: BITCODE_RS,
    pub unknown_530: BITCODE_RC,
    pub unknown_59: BITCODE_RS,
    pub aspect_ratio: BITCODE_RD,
}
#[test]
fn bindgen_test_layout__dwg_header_variables() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_header_variables> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_header_variables>(),
        3288usize,
        concat!("Size of: ", stringify!(_dwg_header_variables))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_header_variables>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_header_variables))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bitsize_hi) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(bitsize_hi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bitsize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(bitsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ACADMAINTVER) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ACADMAINTVER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).REQUIREDVERSIONS) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(REQUIREDVERSIONS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DWGCODEPAGE) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DWGCODEPAGE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).codepage) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(codepage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit1_ratio) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unit1_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit2_ratio) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unit2_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit3_ratio) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unit3_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit4_ratio) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unit4_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit1_name) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unit1_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit2_name) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unit2_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit3_name) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unit3_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit4_name) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unit4_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_8) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_9) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_10) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VX_TABLE_RECORD) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VX_TABLE_RECORD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMASO) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMASO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSHO) as usize - ptr as usize },
        129usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSHO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSAV) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSAV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PLINEGEN) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PLINEGEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ORTHOMODE) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ORTHOMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).REGENMODE) as usize - ptr as usize },
        133usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(REGENMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FILLMODE) as usize - ptr as usize },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(FILLMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QTEXTMODE) as usize - ptr as usize },
        135usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(QTEXTMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PSLTSCALE) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PSLTSCALE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LIMCHECK) as usize - ptr as usize },
        137usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LIMCHECK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MENUEXT) as usize - ptr as usize },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(MENUEXT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BLIPMODE) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(BLIPMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_11) as usize - ptr as usize },
        185usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USRTIMER) as usize - ptr as usize },
        186usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USRTIMER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FASTZOOM) as usize - ptr as usize },
        187usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(FASTZOOM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FLATLAND) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(FLATLAND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VIEWMODE) as usize - ptr as usize },
        189usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VIEWMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SKPOLY) as usize - ptr as usize },
        190usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SKPOLY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_mon) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_day) as usize - ptr as usize },
        194usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_day)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_year) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_hour) as usize - ptr as usize },
        198usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_min) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_sec) as usize - ptr as usize },
        202usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_ms) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ANGDIR) as usize - ptr as usize },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ANGDIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SPLFRAME) as usize - ptr as usize },
        207usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SPLFRAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ATTREQ) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ATTREQ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ATTDIA) as usize - ptr as usize },
        209usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ATTDIA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MIRRTEXT) as usize - ptr as usize },
        210usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(MIRRTEXT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).WORLDVIEW) as usize - ptr as usize },
        211usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(WORLDVIEW)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).WIREFRAME) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(WIREFRAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TILEMODE) as usize - ptr as usize },
        213usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TILEMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PLIMCHECK) as usize - ptr as usize },
        214usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PLIMCHECK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VISRETAIN) as usize - ptr as usize },
        215usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VISRETAIN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DELOBJ) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DELOBJ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DISPSILH) as usize - ptr as usize },
        217usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DISPSILH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PELLIPSE) as usize - ptr as usize },
        218usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PELLIPSE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SAVEIMAGES) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SAVEIMAGES)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PROXYGRAPHICS) as usize - ptr as usize },
        222usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PROXYGRAPHICS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MEASUREMENT) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(MEASUREMENT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DRAGMODE) as usize - ptr as usize },
        226usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DRAGMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TREEDEPTH) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TREEDEPTH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LUNITS) as usize - ptr as usize },
        230usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LUNITS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LUPREC) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LUPREC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AUNITS) as usize - ptr as usize },
        234usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(AUNITS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AUPREC) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(AUPREC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ATTMODE) as usize - ptr as usize },
        238usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ATTMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).COORDS) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(COORDS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PDMODE) as usize - ptr as usize },
        242usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PDMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PICKSTYLE) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PICKSTYLE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OSMODE) as usize - ptr as usize },
        246usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(OSMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_12) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_13) as usize - ptr as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_14) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERI1) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERI1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERI2) as usize - ptr as usize },
        262usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERI2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERI3) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERI3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERI4) as usize - ptr as usize },
        266usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERI4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERI5) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERI5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SPLINESEGS) as usize - ptr as usize },
        270usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SPLINESEGS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SURFU) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SURFU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SURFV) as usize - ptr as usize },
        274usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SURFV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SURFTYPE) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SURFTYPE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SURFTAB1) as usize - ptr as usize },
        278usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SURFTAB1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SURFTAB2) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SURFTAB2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SPLINETYPE) as usize - ptr as usize },
        282usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SPLINETYPE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SHADEDGE) as usize - ptr as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SHADEDGE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SHADEDIF) as usize - ptr as usize },
        286usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SHADEDIF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UNITMODE) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UNITMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MAXACTVP) as usize - ptr as usize },
        290usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(MAXACTVP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ISOLINES) as usize - ptr as usize },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ISOLINES)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMLJUST) as usize - ptr as usize },
        294usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CMLJUST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TEXTQLTY) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TEXTQLTY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_14b) as usize - ptr as usize },
        300usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_14b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LTSCALE) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LTSCALE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TEXTSIZE) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TEXTSIZE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TRACEWID) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TRACEWID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SKETCHINC) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SKETCHINC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FILLETRAD) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(FILLETRAD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).THICKNESS) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(THICKNESS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ANGBASE) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ANGBASE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PDSIZE) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PDSIZE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PLINEWID) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PLINEWID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERR1) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERR1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERR2) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERR2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERR3) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERR3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERR4) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERR4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).USERR5) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(USERR5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CHAMFERA) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CHAMFERA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CHAMFERB) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CHAMFERB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CHAMFERC) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CHAMFERC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CHAMFERD) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CHAMFERD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FACETRES) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(FACETRES)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMLSCALE) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CMLSCALE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CELTSCALE) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CELTSCALE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VIEWTWIST) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VIEWTWIST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MENU) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(MENU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TDCREATE) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TDCREATE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TDUPDATE) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TDUPDATE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TDUCREATE) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TDUCREATE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TDUUPDATE) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TDUUPDATE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_15) as usize - ptr as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_16) as usize - ptr as usize },
        556usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_17) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_17)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TDINDWG) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TDINDWG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TDUSRTIMER) as usize - ptr as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TDUSRTIMER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CECOLOR) as usize - ptr as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CECOLOR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HANDLING) as usize - ptr as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(HANDLING)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HANDSEED) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(HANDSEED)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_4f2) as usize - ptr as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_4f2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_5) as usize - ptr as usize },
        668usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_6) as usize - ptr as usize },
        670usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_6a) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_6a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_6b) as usize - ptr as usize },
        674usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_6b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_6c) as usize - ptr as usize },
        676usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_6c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CLAYER) as usize - ptr as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CLAYER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TEXTSTYLE) as usize - ptr as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TEXTSTYLE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CELTYPE) as usize - ptr as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CELTYPE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMATERIAL) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CMATERIAL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSTYLE) as usize - ptr as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSTYLE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CMLSTYLE) as usize - ptr as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CMLSTYLE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PSVPSCALE) as usize - ptr as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PSVPSCALE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PINSBASE) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PINSBASE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PEXTMIN) as usize - ptr as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PEXTMIN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PEXTMAX) as usize - ptr as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PEXTMAX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PLIMMIN) as usize - ptr as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PLIMMIN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PLIMMAX) as usize - ptr as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PLIMMAX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PELEVATION) as usize - ptr as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PELEVATION)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSORG) as usize - ptr as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSORG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSXDIR) as usize - ptr as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSXDIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSYDIR) as usize - ptr as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSYDIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSNAME) as usize - ptr as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSNAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSBASE) as usize - ptr as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSBASE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSORTHOREF) as usize - ptr as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSORTHOREF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSORTHOVIEW) as usize - ptr as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSORTHOVIEW)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSORGTOP) as usize - ptr as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSORGTOP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSORGBOTTOM) as usize - ptr as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSORGBOTTOM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSORGLEFT) as usize - ptr as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSORGLEFT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSORGRIGHT) as usize - ptr as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSORGRIGHT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSORGFRONT) as usize - ptr as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSORGFRONT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PUCSORGBACK) as usize - ptr as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PUCSORGBACK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INSBASE) as usize - ptr as usize },
        1096usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(INSBASE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EXTMIN) as usize - ptr as usize },
        1120usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(EXTMIN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EXTMAX) as usize - ptr as usize },
        1144usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(EXTMAX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VIEWDIR) as usize - ptr as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VIEWDIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TARGET) as usize - ptr as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TARGET)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LIMMIN) as usize - ptr as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LIMMIN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LIMMAX) as usize - ptr as usize },
        1232usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LIMMAX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VIEWCTR) as usize - ptr as usize },
        1248usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VIEWCTR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ELEVATION) as usize - ptr as usize },
        1272usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ELEVATION)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VIEWSIZE) as usize - ptr as usize },
        1280usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VIEWSIZE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SNAPMODE) as usize - ptr as usize },
        1288usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SNAPMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SNAPUNIT) as usize - ptr as usize },
        1296usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SNAPUNIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SNAPBASE) as usize - ptr as usize },
        1312usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SNAPBASE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SNAPANG) as usize - ptr as usize },
        1328usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SNAPANG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SNAPSTYLE) as usize - ptr as usize },
        1336usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SNAPSTYLE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SNAPISOPAIR) as usize - ptr as usize },
        1338usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SNAPISOPAIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GRIDMODE) as usize - ptr as usize },
        1340usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(GRIDMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GRIDUNIT) as usize - ptr as usize },
        1344usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(GRIDUNIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AXISMODE) as usize - ptr as usize },
        1360usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(AXISMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AXISUNIT) as usize - ptr as usize },
        1368usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(AXISUNIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VPOINTX) as usize - ptr as usize },
        1384usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VPOINTX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VPOINTY) as usize - ptr as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VPOINTY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VPOINTZ) as usize - ptr as usize },
        1432usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VPOINTZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VPOINTXALT) as usize - ptr as usize },
        1456usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VPOINTXALT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VPOINTYALT) as usize - ptr as usize },
        1480usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VPOINTYALT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VPOINTZALT) as usize - ptr as usize },
        1504usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VPOINTZALT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag_3d) as usize - ptr as usize },
        1528usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(flag_3d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSORG) as usize - ptr as usize },
        1536usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSORG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSXDIR) as usize - ptr as usize },
        1560usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSXDIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSYDIR) as usize - ptr as usize },
        1584usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSYDIR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSNAME) as usize - ptr as usize },
        1608usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSNAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSBASE) as usize - ptr as usize },
        1616usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSBASE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSORTHOVIEW) as usize - ptr as usize },
        1624usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSORTHOVIEW)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSORTHOREF) as usize - ptr as usize },
        1632usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSORTHOREF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSORGTOP) as usize - ptr as usize },
        1640usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSORGTOP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSORGBOTTOM) as usize - ptr as usize },
        1664usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSORGBOTTOM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSORGLEFT) as usize - ptr as usize },
        1688usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSORGLEFT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSORGRIGHT) as usize - ptr as usize },
        1712usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSORGRIGHT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSORGFRONT) as usize - ptr as usize },
        1736usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSORGFRONT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSORGBACK) as usize - ptr as usize },
        1760usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSORGBACK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMPOST) as usize - ptr as usize },
        1784usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMPOST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMAPOST) as usize - ptr as usize },
        1792usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMAPOST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTOL) as usize - ptr as usize },
        1800usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTOL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMLIM) as usize - ptr as usize },
        1801usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMLIM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTIH) as usize - ptr as usize },
        1802usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTIH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTOH) as usize - ptr as usize },
        1803usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTOH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSE1) as usize - ptr as usize },
        1804usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSE1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSE2) as usize - ptr as usize },
        1805usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSE2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALT) as usize - ptr as usize },
        1806usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTOFL) as usize - ptr as usize },
        1807usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTOFL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSAH) as usize - ptr as usize },
        1808usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSAH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTIX) as usize - ptr as usize },
        1809usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTIX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSOXD) as usize - ptr as usize },
        1810usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSOXD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALTD) as usize - ptr as usize },
        1812usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALTD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMZIN) as usize - ptr as usize },
        1814usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMZIN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSD1) as usize - ptr as usize },
        1816usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSD1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSD2) as usize - ptr as usize },
        1817usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSD2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTOLJ) as usize - ptr as usize },
        1818usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTOLJ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMJUST) as usize - ptr as usize },
        1820usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMJUST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMFIT) as usize - ptr as usize },
        1822usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMFIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMUPT) as usize - ptr as usize },
        1824usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMUPT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTZIN) as usize - ptr as usize },
        1826usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTZIN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTAD) as usize - ptr as usize },
        1828usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTAD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMUNIT) as usize - ptr as usize },
        1830usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMUNIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMAUNIT) as usize - ptr as usize },
        1832usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMAUNIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMDEC) as usize - ptr as usize },
        1834usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMDEC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTDEC) as usize - ptr as usize },
        1836usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTDEC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALTU) as usize - ptr as usize },
        1838usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALTU)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALTTD) as usize - ptr as usize },
        1840usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALTTD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTXSTY) as usize - ptr as usize },
        1848usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTXSTY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSCALE) as usize - ptr as usize },
        1856usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSCALE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMARROW) as usize - ptr as usize },
        1864usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMARROW)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMASZ) as usize - ptr as usize },
        1872usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMASZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMEXO) as usize - ptr as usize },
        1880usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMEXO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMDLI) as usize - ptr as usize },
        1888usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMDLI)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMEXE) as usize - ptr as usize },
        1896usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMEXE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMRND) as usize - ptr as usize },
        1904usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMRND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMDLE) as usize - ptr as usize },
        1912usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMDLE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTP) as usize - ptr as usize },
        1920usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTM) as usize - ptr as usize },
        1928usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMFXL) as usize - ptr as usize },
        1936usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMFXL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMJOGANG) as usize - ptr as usize },
        1944usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMJOGANG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTFILL) as usize - ptr as usize },
        1952usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTFILL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTFILLCLR) as usize - ptr as usize },
        1960usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTFILLCLR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMAZIN) as usize - ptr as usize },
        2008usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMAZIN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMARCSYM) as usize - ptr as usize },
        2010usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMARCSYM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTXT) as usize - ptr as usize },
        2016usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTXT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMCEN) as usize - ptr as usize },
        2024usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMCEN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTSZ) as usize - ptr as usize },
        2032usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTSZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALTF) as usize - ptr as usize },
        2040usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALTF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMLFAC) as usize - ptr as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMLFAC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTVP) as usize - ptr as usize },
        2056usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTVP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTFAC) as usize - ptr as usize },
        2064usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTFAC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMGAP) as usize - ptr as usize },
        2072usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMGAP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMPOST_T) as usize - ptr as usize },
        2080usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMPOST_T)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMAPOST_T) as usize - ptr as usize },
        2088usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMAPOST_T)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMBLK_T) as usize - ptr as usize },
        2096usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMBLK_T)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMBLK1_T) as usize - ptr as usize },
        2104usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMBLK1_T)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMBLK2_T) as usize - ptr as usize },
        2112usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMBLK2_T)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_string) as usize - ptr as usize },
        2120usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALTRND) as usize - ptr as usize },
        2128usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALTRND)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMCLRD_C) as usize - ptr as usize },
        2136usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMCLRD_C)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMCLRE_C) as usize - ptr as usize },
        2138usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMCLRE_C)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMCLRT_C) as usize - ptr as usize },
        2140usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMCLRT_C)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMCLRD) as usize - ptr as usize },
        2144usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMCLRD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMCLRE) as usize - ptr as usize },
        2192usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMCLRE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMCLRT) as usize - ptr as usize },
        2240usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMCLRT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMADEC) as usize - ptr as usize },
        2288usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMADEC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMFRAC) as usize - ptr as usize },
        2290usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMFRAC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMLUNIT) as usize - ptr as usize },
        2292usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMLUNIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMDSEP) as usize - ptr as usize },
        2294usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMDSEP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTMOVE) as usize - ptr as usize },
        2296usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTMOVE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALTZ) as usize - ptr as usize },
        2298usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALTZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALTTZ) as usize - ptr as usize },
        2300usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALTTZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMATFIT) as usize - ptr as usize },
        2302usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMATFIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMFXLON) as usize - ptr as usize },
        2304usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMFXLON)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMTXTDIRECTION) as usize - ptr as usize },
        2305usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMTXTDIRECTION)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALTMZF) as usize - ptr as usize },
        2312usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALTMZF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMALTMZS) as usize - ptr as usize },
        2320usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMALTMZS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMMZF) as usize - ptr as usize },
        2328usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMMZF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMMZS) as usize - ptr as usize },
        2336usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMMZS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMLDRBLK) as usize - ptr as usize },
        2344usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMLDRBLK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMBLK) as usize - ptr as usize },
        2352usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMBLK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMBLK1) as usize - ptr as usize },
        2360usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMBLK1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMBLK2) as usize - ptr as usize },
        2368usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMBLK2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMLTYPE) as usize - ptr as usize },
        2376usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMLTYPE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMLTEX1) as usize - ptr as usize },
        2384usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMLTEX1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMLTEX2) as usize - ptr as usize },
        2392usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMLTEX2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMLWD) as usize - ptr as usize },
        2400usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMLWD)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMLWE) as usize - ptr as usize },
        2402usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMLWE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BLOCK_CONTROL_OBJECT) as usize - ptr as usize },
        2408usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(BLOCK_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LAYER_CONTROL_OBJECT) as usize - ptr as usize },
        2416usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LAYER_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).STYLE_CONTROL_OBJECT) as usize - ptr as usize },
        2424usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(STYLE_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LTYPE_CONTROL_OBJECT) as usize - ptr as usize },
        2432usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LTYPE_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VIEW_CONTROL_OBJECT) as usize - ptr as usize },
        2440usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VIEW_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCS_CONTROL_OBJECT) as usize - ptr as usize },
        2448usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCS_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VPORT_CONTROL_OBJECT) as usize - ptr as usize },
        2456usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VPORT_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).APPID_CONTROL_OBJECT) as usize - ptr as usize },
        2464usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(APPID_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMSTYLE_CONTROL_OBJECT) as usize - ptr as usize },
        2472usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMSTYLE_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VX_CONTROL_OBJECT) as usize - ptr as usize },
        2480usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VX_CONTROL_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_ACAD_GROUP) as usize - ptr as usize },
        2488usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_ACAD_GROUP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_ACAD_MLINESTYLE) as usize - ptr as usize },
        2496usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_ACAD_MLINESTYLE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_NAMED_OBJECT) as usize - ptr as usize },
        2504usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_NAMED_OBJECT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TSTACKALIGN) as usize - ptr as usize },
        2512usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TSTACKALIGN)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TSTACKSIZE) as usize - ptr as usize },
        2514usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TSTACKSIZE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HYPERLINKBASE) as usize - ptr as usize },
        2520usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(HYPERLINKBASE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).STYLESHEET) as usize - ptr as usize },
        2528usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(STYLESHEET)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_LAYOUT) as usize - ptr as usize },
        2536usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_LAYOUT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_PLOTSETTINGS) as usize - ptr as usize },
        2544usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_PLOTSETTINGS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_PLOTSTYLENAME) as usize - ptr as usize },
        2552usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_PLOTSTYLENAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_MATERIAL) as usize - ptr as usize },
        2560usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_MATERIAL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_COLOR) as usize - ptr as usize },
        2568usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_COLOR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_VISUALSTYLE) as usize - ptr as usize },
        2576usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_VISUALSTYLE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DICTIONARY_LIGHTLIST) as usize - ptr as usize },
        2584usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DICTIONARY_LIGHTLIST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_20) as usize - ptr as usize },
        2592usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FLAGS) as usize - ptr as usize },
        2600usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(FLAGS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CELWEIGHT) as usize - ptr as usize },
        2604usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CELWEIGHT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ENDCAPS) as usize - ptr as usize },
        2606usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(ENDCAPS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).JOINSTYLE) as usize - ptr as usize },
        2607usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(JOINSTYLE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LWDISPLAY) as usize - ptr as usize },
        2608usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LWDISPLAY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).XEDIT) as usize - ptr as usize },
        2609usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(XEDIT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EXTNAMES) as usize - ptr as usize },
        2610usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(EXTNAMES)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PSTYLEMODE) as usize - ptr as usize },
        2611usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PSTYLEMODE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OLESTARTUP) as usize - ptr as usize },
        2612usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(OLESTARTUP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INSUNITS) as usize - ptr as usize },
        2614usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(INSUNITS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CEPSNTYPE) as usize - ptr as usize },
        2616usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CEPSNTYPE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CPSNID) as usize - ptr as usize },
        2624usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CPSNID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FINGERPRINTGUID) as usize - ptr as usize },
        2632usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(FINGERPRINTGUID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VERSIONGUID) as usize - ptr as usize },
        2640usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(VERSIONGUID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SORTENTS) as usize - ptr as usize },
        2648usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SORTENTS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INDEXCTL) as usize - ptr as usize },
        2649usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(INDEXCTL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HIDETEXT) as usize - ptr as usize },
        2650usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(HIDETEXT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).XCLIPFRAME) as usize - ptr as usize },
        2651usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(XCLIPFRAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DIMASSOC) as usize - ptr as usize },
        2652usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DIMASSOC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HALOGAP) as usize - ptr as usize },
        2653usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(HALOGAP)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OBSCOLOR) as usize - ptr as usize },
        2654usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(OBSCOLOR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INTERSECTIONCOLOR) as usize - ptr as usize },
        2656usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(INTERSECTIONCOLOR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OBSLTYPE) as usize - ptr as usize },
        2658usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(OBSLTYPE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INTERSECTIONDISPLAY) as usize - ptr as usize },
        2659usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(INTERSECTIONDISPLAY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PROJECTNAME) as usize - ptr as usize },
        2664usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PROJECTNAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BLOCK_RECORD_PSPACE) as usize - ptr as usize },
        2672usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(BLOCK_RECORD_PSPACE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BLOCK_RECORD_MSPACE) as usize - ptr as usize },
        2680usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(BLOCK_RECORD_MSPACE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LTYPE_BYLAYER) as usize - ptr as usize },
        2688usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LTYPE_BYLAYER)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LTYPE_BYBLOCK) as usize - ptr as usize },
        2696usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LTYPE_BYBLOCK)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LTYPE_CONTINUOUS) as usize - ptr as usize },
        2704usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LTYPE_CONTINUOUS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CAMERADISPLAY) as usize - ptr as usize },
        2712usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CAMERADISPLAY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_21) as usize - ptr as usize },
        2716usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_21)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_22) as usize - ptr as usize },
        2720usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_22)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_23) as usize - ptr as usize },
        2728usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_23)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).STEPSPERSEC) as usize - ptr as usize },
        2736usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(STEPSPERSEC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).STEPSIZE) as usize - ptr as usize },
        2744usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(STEPSIZE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._3DDWFPREC) as usize - ptr as usize },
        2752usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(_3DDWFPREC)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LENSLENGTH) as usize - ptr as usize },
        2760usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LENSLENGTH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CAMERAHEIGHT) as usize - ptr as usize },
        2768usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CAMERAHEIGHT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SOLIDHIST) as usize - ptr as usize },
        2776usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SOLIDHIST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SHOWHIST) as usize - ptr as usize },
        2777usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SHOWHIST)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PSOLWIDTH) as usize - ptr as usize },
        2784usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PSOLWIDTH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PSOLHEIGHT) as usize - ptr as usize },
        2792usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(PSOLHEIGHT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LOFTANG1) as usize - ptr as usize },
        2800usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LOFTANG1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LOFTANG2) as usize - ptr as usize },
        2808usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LOFTANG2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LOFTMAG1) as usize - ptr as usize },
        2816usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LOFTMAG1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LOFTMAG2) as usize - ptr as usize },
        2824usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LOFTMAG2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LOFTPARAM) as usize - ptr as usize },
        2832usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LOFTPARAM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LOFTNORMALS) as usize - ptr as usize },
        2834usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LOFTNORMALS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LATITUDE) as usize - ptr as usize },
        2840usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LATITUDE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LONGITUDE) as usize - ptr as usize },
        2848usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LONGITUDE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NORTHDIRECTION) as usize - ptr as usize },
        2856usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(NORTHDIRECTION)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TIMEZONE) as usize - ptr as usize },
        2864usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TIMEZONE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LIGHTGLYPHDISPLAY) as usize - ptr as usize },
        2868usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(LIGHTGLYPHDISPLAY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TILEMODELIGHTSYNCH) as usize - ptr as usize },
        2869usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(TILEMODELIGHTSYNCH)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DWFFRAME) as usize - ptr as usize },
        2870usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DWFFRAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DGNFRAME) as usize - ptr as usize },
        2871usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DGNFRAME)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).REALWORLDSCALE) as usize - ptr as usize },
        2872usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(REALWORLDSCALE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INTERFERECOLOR) as usize - ptr as usize },
        2880usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(INTERFERECOLOR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INTERFEREOBJVS) as usize - ptr as usize },
        2928usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(INTERFEREOBJVS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).INTERFEREVPVS) as usize - ptr as usize },
        2936usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(INTERFEREVPVS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DRAGVS) as usize - ptr as usize },
        2944usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(DRAGVS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CSHADOW) as usize - ptr as usize },
        2952usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(CSHADOW)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SHADOWPLANELOCATION) as usize - ptr as usize },
        2960usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(SHADOWPLANELOCATION)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_54) as usize - ptr as usize },
        2968usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_54)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_55) as usize - ptr as usize },
        2970usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_55)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_56) as usize - ptr as usize },
        2972usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_56)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_57) as usize - ptr as usize },
        2974usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_57)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwg_size) as usize - ptr as usize },
        2976usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(dwg_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numentities) as usize - ptr as usize },
        2980usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(numentities)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).circle_zoom_percent) as usize - ptr as usize },
        2982usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(circle_zoom_percent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FRONTZ) as usize - ptr as usize },
        2984usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(FRONTZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BACKZ) as usize - ptr as usize },
        2992usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(BACKZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UCSICON) as usize - ptr as usize },
        3000usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(UCSICON)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oldCECOLOR_hi) as usize - ptr as usize },
        3004usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(oldCECOLOR_hi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oldCECOLOR_lo) as usize - ptr as usize },
        3008usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(oldCECOLOR_lo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layer_colors) as usize - ptr as usize },
        3012usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(layer_colors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_51e) as usize - ptr as usize },
        3268usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_51e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_520) as usize - ptr as usize },
        3270usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_520)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_52c) as usize - ptr as usize },
        3272usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_52c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_52e) as usize - ptr as usize },
        3274usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_52e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_530) as usize - ptr as usize },
        3276usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_530)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_59) as usize - ptr as usize },
        3278usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(unknown_59)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aspect_ratio) as usize - ptr as usize },
        3280usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_header_variables),
            "::",
            stringify!(aspect_ratio)
        )
    );
}
#[doc = "\\struct Dwg_Header_Variables\nDWG header variables for all versions.\nIf uppercase related to the DXF HEADER $ name.\n\n\\ref _dwg_header_variables"]
pub type Dwg_Header_Variables = _dwg_header_variables;
#[doc = "UNUSED (0) entity. Unknown entities are stored as blob"]
pub type Dwg_Entity_UNUSED = ::std::os::raw::c_int;
#[doc = " \\ref Dwg_Entity_TEXT\nTEXT (1/7) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_TEXT {
    pub parent: *mut _dwg_object_entity,
    #[doc = "< r2000+. should be renamed to opts for r11 compat"]
    pub dataflags: BITCODE_RC,
    #[doc = "< DXF 30 (z coord of 10), when dataflags & 1"]
    pub elevation: BITCODE_RD,
    #[doc = "< DXF 10"]
    pub ins_pt: BITCODE_2DPOINT,
    #[doc = "< DXF 11. optional, when dataflags & 2, i.e 72/73 != 0"]
    pub alignment_pt: BITCODE_2DPOINT,
    #[doc = "< DXF 210. Default 0,0,1"]
    pub extrusion: BITCODE_BE,
    #[doc = "< DXF 39"]
    pub thickness: BITCODE_RD,
    #[doc = "< DXF 51"]
    pub oblique_angle: BITCODE_RD,
    #[doc = "< DXF 50"]
    pub rotation: BITCODE_RD,
    #[doc = "< DXF 40"]
    pub height: BITCODE_RD,
    #[doc = "< DXF 41"]
    pub width_factor: BITCODE_RD,
    #[doc = "< DXF 1"]
    pub text_value: BITCODE_TV,
    #[doc = "< DXF 71"]
    pub generation: BITCODE_BS,
    #[doc = "< DXF 72. options 0-5:\n0 = Left; 1= Center; 2 = Right; 3 = Aligned;\n4 = Middle; 5 = Fit"]
    pub horiz_alignment: BITCODE_BS,
    #[doc = "< DXF 73. options 0-3:\n0 = Baseline; 1 = Bottom; 2 = Middle; 3 = Top"]
    pub vert_alignment: BITCODE_BS,
    #[doc = "< code 5, DXF 7, optional"]
    pub style: BITCODE_H,
}
#[test]
fn bindgen_test_layout__dwg_entity_TEXT() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_TEXT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_TEXT>(),
        144usize,
        concat!("Size of: ", stringify!(_dwg_entity_TEXT))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_TEXT>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_TEXT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataflags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(dataflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ins_pt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(ins_pt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alignment_pt) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(alignment_pt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(extrusion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thickness) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(thickness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oblique_angle) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(oblique_angle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(rotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width_factor) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(width_factor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text_value) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(text_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generation) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(generation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).horiz_alignment) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(horiz_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vert_alignment) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(vert_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).style) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_TEXT),
            "::",
            stringify!(style)
        )
    );
}
#[doc = " \\ref Dwg_Entity_TEXT\nTEXT (1/7) entity"]
pub type Dwg_Entity_TEXT = _dwg_entity_TEXT;
#[doc = " \\ref Dwg_Entity_ATTRIB\nATTRIB (2/16) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_ATTRIB {
    pub parent: *mut _dwg_object_entity,
    pub elevation: BITCODE_BD,
    pub ins_pt: BITCODE_2DPOINT,
    pub alignment_pt: BITCODE_2DPOINT,
    pub extrusion: BITCODE_BE,
    pub thickness: BITCODE_RD,
    pub oblique_angle: BITCODE_RD,
    pub rotation: BITCODE_RD,
    pub height: BITCODE_RD,
    pub width_factor: BITCODE_RD,
    pub text_value: BITCODE_TV,
    pub generation: BITCODE_BS,
    pub horiz_alignment: BITCODE_BS,
    pub vert_alignment: BITCODE_BS,
    pub dataflags: BITCODE_RC,
    pub class_version: BITCODE_RC,
    pub type_: BITCODE_RC,
    pub tag: BITCODE_TV,
    pub field_length: BITCODE_BS,
    pub flags: BITCODE_RC,
    pub lock_position_flag: BITCODE_B,
    pub style: BITCODE_H,
    pub mtext_style: BITCODE_H,
    pub annotative_data_size: BITCODE_BS,
    pub annotative_data_bytes: BITCODE_RC,
    pub annotative_app: BITCODE_H,
    pub annotative_short: BITCODE_BS,
}
#[test]
fn bindgen_test_layout__dwg_entity_ATTRIB() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_ATTRIB> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_ATTRIB>(),
        192usize,
        concat!("Size of: ", stringify!(_dwg_entity_ATTRIB))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_ATTRIB>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_ATTRIB))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ins_pt) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(ins_pt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alignment_pt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(alignment_pt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(extrusion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thickness) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(thickness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oblique_angle) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(oblique_angle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(rotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width_factor) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(width_factor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text_value) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(text_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generation) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(generation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).horiz_alignment) as usize - ptr as usize },
        122usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(horiz_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vert_alignment) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(vert_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataflags) as usize - ptr as usize },
        126usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(dataflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_version) as usize - ptr as usize },
        127usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(class_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_length) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(field_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock_position_flag) as usize - ptr as usize },
        147usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(lock_position_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).style) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtext_style) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(mtext_style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotative_data_size) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(annotative_data_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotative_data_bytes) as usize - ptr as usize },
        170usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(annotative_data_bytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotative_app) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(annotative_app)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotative_short) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTRIB),
            "::",
            stringify!(annotative_short)
        )
    );
}
#[doc = " \\ref Dwg_Entity_ATTRIB\nATTRIB (2/16) entity"]
pub type Dwg_Entity_ATTRIB = _dwg_entity_ATTRIB;
#[doc = " \\ref Dwg_Entity_ATTDEF\nATTDEF (3/15) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_ATTDEF {
    pub parent: *mut _dwg_object_entity,
    pub elevation: BITCODE_BD,
    pub ins_pt: BITCODE_2DPOINT,
    pub alignment_pt: BITCODE_2DPOINT,
    pub extrusion: BITCODE_BE,
    pub thickness: BITCODE_RD,
    pub oblique_angle: BITCODE_RD,
    pub rotation: BITCODE_RD,
    pub height: BITCODE_RD,
    pub width_factor: BITCODE_RD,
    pub default_value: BITCODE_TV,
    pub generation: BITCODE_BS,
    pub horiz_alignment: BITCODE_BS,
    pub vert_alignment: BITCODE_BS,
    pub dataflags: BITCODE_RC,
    pub class_version: BITCODE_RC,
    pub type_: BITCODE_RC,
    pub tag: BITCODE_TV,
    pub field_length: BITCODE_BS,
    pub flags: BITCODE_RC,
    pub lock_position_flag: BITCODE_B,
    pub style: BITCODE_H,
    pub mtext_style: BITCODE_H,
    pub annotative_data_size: BITCODE_BS,
    pub annotative_data_bytes: BITCODE_RC,
    pub annotative_app: BITCODE_H,
    pub annotative_short: BITCODE_BS,
    pub attdef_class_version: BITCODE_RC,
    pub prompt: BITCODE_TV,
}
#[test]
fn bindgen_test_layout__dwg_entity_ATTDEF() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_ATTDEF> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_ATTDEF>(),
        200usize,
        concat!("Size of: ", stringify!(_dwg_entity_ATTDEF))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_ATTDEF>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_ATTDEF))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ins_pt) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(ins_pt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alignment_pt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(alignment_pt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(extrusion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thickness) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(thickness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oblique_angle) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(oblique_angle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(rotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width_factor) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(width_factor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_value) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(default_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).generation) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(generation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).horiz_alignment) as usize - ptr as usize },
        122usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(horiz_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vert_alignment) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(vert_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataflags) as usize - ptr as usize },
        126usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(dataflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).class_version) as usize - ptr as usize },
        127usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(class_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).field_length) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(field_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock_position_flag) as usize - ptr as usize },
        147usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(lock_position_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).style) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtext_style) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(mtext_style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotative_data_size) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(annotative_data_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotative_data_bytes) as usize - ptr as usize },
        170usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(annotative_data_bytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotative_app) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(annotative_app)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotative_short) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(annotative_short)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attdef_class_version) as usize - ptr as usize },
        186usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(attdef_class_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prompt) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ATTDEF),
            "::",
            stringify!(prompt)
        )
    );
}
#[doc = " \\ref Dwg_Entity_ATTDEF\nATTDEF (3/15) entity"]
pub type Dwg_Entity_ATTDEF = _dwg_entity_ATTDEF;
#[doc = "BLOCK (4/12) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_BLOCK {
    pub parent: *mut _dwg_object_entity,
    pub name: BITCODE_TV,
    pub xref_pname: BITCODE_TV,
    pub base_pt: BITCODE_2RD,
}
#[test]
fn bindgen_test_layout__dwg_entity_BLOCK() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_BLOCK> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_BLOCK>(),
        40usize,
        concat!("Size of: ", stringify!(_dwg_entity_BLOCK))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_BLOCK>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_BLOCK))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_BLOCK),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_BLOCK),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xref_pname) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_BLOCK),
            "::",
            stringify!(xref_pname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_pt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_BLOCK),
            "::",
            stringify!(base_pt)
        )
    );
}
#[doc = "BLOCK (4/12) entity"]
pub type Dwg_Entity_BLOCK = _dwg_entity_BLOCK;
#[doc = "ENDBLK (5/13) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_ENDBLK {
    pub parent: *mut _dwg_object_entity,
}
#[test]
fn bindgen_test_layout__dwg_entity_ENDBLK() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_ENDBLK> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_ENDBLK>(),
        8usize,
        concat!("Size of: ", stringify!(_dwg_entity_ENDBLK))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_ENDBLK>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_ENDBLK))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ENDBLK),
            "::",
            stringify!(parent)
        )
    );
}
#[doc = "ENDBLK (5/13) entity"]
pub type Dwg_Entity_ENDBLK = _dwg_entity_ENDBLK;
#[doc = "SEQEND (6/17) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_SEQEND {
    pub parent: *mut _dwg_object_entity,
    pub begin_addr_r11: BITCODE_RL,
}
#[test]
fn bindgen_test_layout__dwg_entity_SEQEND() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_SEQEND> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_SEQEND>(),
        16usize,
        concat!("Size of: ", stringify!(_dwg_entity_SEQEND))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_SEQEND>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_SEQEND))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_SEQEND),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).begin_addr_r11) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_SEQEND),
            "::",
            stringify!(begin_addr_r11)
        )
    );
}
#[doc = "SEQEND (6/17) entity"]
pub type Dwg_Entity_SEQEND = _dwg_entity_SEQEND;
#[doc = "INSERT (7/14) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_INSERT {
    pub parent: *mut _dwg_object_entity,
    pub ins_pt: BITCODE_3DPOINT,
    pub scale_flag: BITCODE_BB,
    pub scale: BITCODE_3DPOINT,
    pub rotation: BITCODE_BD,
    pub extrusion: BITCODE_BE,
    pub has_attribs: BITCODE_B,
    pub num_owned: BITCODE_BL,
    pub block_header: BITCODE_H,
    pub first_attrib: BITCODE_H,
    pub last_attrib: BITCODE_H,
    pub attribs: *mut BITCODE_H,
    pub seqend: BITCODE_H,
    pub num_cols: BITCODE_RS,
    pub num_rows: BITCODE_RS,
    pub col_spacing: BITCODE_RD,
    pub row_spacing: BITCODE_RD,
    pub block_name: BITCODE_TV,
}
#[test]
fn bindgen_test_layout__dwg_entity_INSERT() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_INSERT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_INSERT>(),
        176usize,
        concat!("Size of: ", stringify!(_dwg_entity_INSERT))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_INSERT>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_INSERT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ins_pt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(ins_pt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale_flag) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(scale_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(rotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(extrusion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_attribs) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(has_attribs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_owned) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(num_owned)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).block_header) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(block_header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).first_attrib) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(first_attrib)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_attrib) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(last_attrib)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attribs) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(attribs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqend) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(seqend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_cols) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(num_cols)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_rows) as usize - ptr as usize },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(num_rows)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).col_spacing) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(col_spacing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).row_spacing) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(row_spacing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).block_name) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_INSERT),
            "::",
            stringify!(block_name)
        )
    );
}
#[doc = "INSERT (7/14) entity"]
pub type Dwg_Entity_INSERT = _dwg_entity_INSERT;
#[doc = "MINSERT (8) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_MINSERT {
    pub parent: *mut _dwg_object_entity,
    pub ins_pt: BITCODE_3DPOINT,
    pub scale_flag: BITCODE_BB,
    pub scale: BITCODE_3DPOINT,
    pub rotation: BITCODE_BD,
    pub extrusion: BITCODE_BE,
    pub has_attribs: BITCODE_B,
    pub num_owned: BITCODE_BL,
    pub num_cols: BITCODE_BS,
    pub num_rows: BITCODE_BS,
    pub col_spacing: BITCODE_BD,
    pub row_spacing: BITCODE_BD,
    pub block_header: BITCODE_H,
    pub first_attrib: BITCODE_H,
    pub last_attrib: BITCODE_H,
    pub attribs: *mut BITCODE_H,
    pub seqend: BITCODE_H,
}
#[test]
fn bindgen_test_layout__dwg_entity_MINSERT() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_MINSERT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_MINSERT>(),
        168usize,
        concat!("Size of: ", stringify!(_dwg_entity_MINSERT))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_MINSERT>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_MINSERT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ins_pt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(ins_pt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale_flag) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(scale_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(rotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(extrusion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_attribs) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(has_attribs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_owned) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(num_owned)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_cols) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(num_cols)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_rows) as usize - ptr as usize },
        106usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(num_rows)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).col_spacing) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(col_spacing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).row_spacing) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(row_spacing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).block_header) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(block_header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).first_attrib) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(first_attrib)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_attrib) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(last_attrib)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attribs) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(attribs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqend) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_MINSERT),
            "::",
            stringify!(seqend)
        )
    );
}
#[doc = "MINSERT (8) entity"]
pub type Dwg_Entity_MINSERT = _dwg_entity_MINSERT;
#[doc = "VERTEX_2D (10/20) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_VERTEX_2D {
    pub parent: *mut _dwg_object_entity,
    pub flag: BITCODE_RC,
    pub point: BITCODE_3BD,
    pub start_width: BITCODE_BD,
    pub end_width: BITCODE_BD,
    pub id: BITCODE_BL,
    pub bulge: BITCODE_BD,
    pub tangent_dir: BITCODE_BD,
}
#[test]
fn bindgen_test_layout__dwg_entity_VERTEX_2D() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_VERTEX_2D> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_VERTEX_2D>(),
        80usize,
        concat!("Size of: ", stringify!(_dwg_entity_VERTEX_2D))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_VERTEX_2D>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_VERTEX_2D))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_2D),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_2D),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).point) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_2D),
            "::",
            stringify!(point)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_width) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_2D),
            "::",
            stringify!(start_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_width) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_2D),
            "::",
            stringify!(end_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_2D),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bulge) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_2D),
            "::",
            stringify!(bulge)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tangent_dir) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_2D),
            "::",
            stringify!(tangent_dir)
        )
    );
}
#[doc = "VERTEX_2D (10/20) entity"]
pub type Dwg_Entity_VERTEX_2D = _dwg_entity_VERTEX_2D;
#[doc = "VERTEX_3D (11) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_VERTEX_3D {
    pub parent: *mut _dwg_object_entity,
    pub flag: BITCODE_RC,
    pub point: BITCODE_3BD,
}
#[test]
fn bindgen_test_layout__dwg_entity_VERTEX_3D() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_VERTEX_3D> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_VERTEX_3D>(),
        40usize,
        concat!("Size of: ", stringify!(_dwg_entity_VERTEX_3D))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_VERTEX_3D>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_VERTEX_3D))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_3D),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_3D),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).point) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_3D),
            "::",
            stringify!(point)
        )
    );
}
#[doc = "VERTEX_3D (11) entity"]
pub type Dwg_Entity_VERTEX_3D = _dwg_entity_VERTEX_3D;
#[doc = "VERTEX_MESH (12) - same as VERTEX_3D entity"]
pub type Dwg_Entity_VERTEX_MESH = Dwg_Entity_VERTEX_3D;
#[doc = "VERTEX_PFACE (13) - same as VERTEX_3D entity"]
pub type Dwg_Entity_VERTEX_PFACE = Dwg_Entity_VERTEX_3D;
#[doc = "VERTEX_PFACE_FACE (14) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_VERTEX_PFACE_FACE {
    pub parent: *mut _dwg_object_entity,
    pub flag: BITCODE_RC,
    pub vertind: [BITCODE_BS; 4usize],
}
#[test]
fn bindgen_test_layout__dwg_entity_VERTEX_PFACE_FACE() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_VERTEX_PFACE_FACE> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_VERTEX_PFACE_FACE>(),
        24usize,
        concat!("Size of: ", stringify!(_dwg_entity_VERTEX_PFACE_FACE))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_VERTEX_PFACE_FACE>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_VERTEX_PFACE_FACE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_PFACE_FACE),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_PFACE_FACE),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertind) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_VERTEX_PFACE_FACE),
            "::",
            stringify!(vertind)
        )
    );
}
#[doc = "VERTEX_PFACE_FACE (14) entity"]
pub type Dwg_Entity_VERTEX_PFACE_FACE = _dwg_entity_VERTEX_PFACE_FACE;
#[doc = "2D POLYLINE (15/19) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_POLYLINE_2D {
    pub parent: *mut _dwg_object_entity,
    pub has_vertex: BITCODE_B,
    pub num_owned: BITCODE_BL,
    pub first_vertex: BITCODE_H,
    pub last_vertex: BITCODE_H,
    pub vertex: *mut BITCODE_H,
    pub seqend: BITCODE_H,
    pub flag: BITCODE_BS,
    pub curve_type: BITCODE_BS,
    pub start_width: BITCODE_BD,
    pub end_width: BITCODE_BD,
    pub thickness: BITCODE_BT,
    pub elevation: BITCODE_BD,
    pub extrusion: BITCODE_BE,
    pub extra_r11_size: BITCODE_BL,
    pub extra_r11_text: BITCODE_TV,
    pub num_m_verts: BITCODE_BS,
    pub num_n_verts: BITCODE_BS,
}
#[test]
fn bindgen_test_layout__dwg_entity_POLYLINE_2D() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_POLYLINE_2D> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_POLYLINE_2D>(),
        136usize,
        concat!("Size of: ", stringify!(_dwg_entity_POLYLINE_2D))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_POLYLINE_2D>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_POLYLINE_2D))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_vertex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(has_vertex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_owned) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(num_owned)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).first_vertex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(first_vertex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_vertex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(last_vertex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertex) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(vertex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqend) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(seqend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).curve_type) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(curve_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_width) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(start_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_width) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(end_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thickness) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(thickness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elevation) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(extrusion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extra_r11_size) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(extra_r11_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extra_r11_text) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(extra_r11_text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_m_verts) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(num_m_verts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_n_verts) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_2D),
            "::",
            stringify!(num_n_verts)
        )
    );
}
#[doc = "2D POLYLINE (15/19) entity"]
pub type Dwg_Entity_POLYLINE_2D = _dwg_entity_POLYLINE_2D;
#[doc = "3D POLYLINE (16/19) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_POLYLINE_3D {
    pub parent: *mut _dwg_object_entity,
    pub has_vertex: BITCODE_B,
    pub num_owned: BITCODE_BL,
    pub first_vertex: BITCODE_H,
    pub last_vertex: BITCODE_H,
    pub vertex: *mut BITCODE_H,
    pub seqend: BITCODE_H,
    pub curve_type: BITCODE_RC,
    pub start_width: BITCODE_BD,
    pub end_width: BITCODE_BD,
    pub flag: BITCODE_RC,
    pub extrusion: BITCODE_BE,
}
#[test]
fn bindgen_test_layout__dwg_entity_POLYLINE_3D() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_POLYLINE_3D> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_POLYLINE_3D>(),
        104usize,
        concat!("Size of: ", stringify!(_dwg_entity_POLYLINE_3D))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_POLYLINE_3D>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_POLYLINE_3D))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_vertex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(has_vertex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_owned) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(num_owned)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).first_vertex) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(first_vertex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_vertex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(last_vertex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertex) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(vertex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqend) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(seqend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).curve_type) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(curve_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_width) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(start_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_width) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(end_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_POLYLINE_3D),
            "::",
            stringify!(extrusion)
        )
    );
}
#[doc = "3D POLYLINE (16/19) entity"]
pub type Dwg_Entity_POLYLINE_3D = _dwg_entity_POLYLINE_3D;
#[doc = "ARC (17/8) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_ARC {
    pub parent: *mut _dwg_object_entity,
    pub center: BITCODE_3BD,
    pub radius: BITCODE_BD,
    pub thickness: BITCODE_BT,
    pub extrusion: BITCODE_BE,
    pub start_angle: BITCODE_BD,
    pub end_angle: BITCODE_BD,
}
#[test]
fn bindgen_test_layout__dwg_entity_ARC() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_ARC> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_ARC>(),
        88usize,
        concat!("Size of: ", stringify!(_dwg_entity_ARC))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_ARC>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_ARC))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ARC),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).center) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ARC),
            "::",
            stringify!(center)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radius) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ARC),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thickness) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ARC),
            "::",
            stringify!(thickness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ARC),
            "::",
            stringify!(extrusion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_angle) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ARC),
            "::",
            stringify!(start_angle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_angle) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_ARC),
            "::",
            stringify!(end_angle)
        )
    );
}
#[doc = "ARC (17/8) entity"]
pub type Dwg_Entity_ARC = _dwg_entity_ARC;
#[doc = "CIRCLE (18/3) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_CIRCLE {
    pub parent: *mut _dwg_object_entity,
    pub center: BITCODE_3BD,
    pub radius: BITCODE_BD,
    pub thickness: BITCODE_BT,
    pub extrusion: BITCODE_BE,
}
#[test]
fn bindgen_test_layout__dwg_entity_CIRCLE() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_CIRCLE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_CIRCLE>(),
        72usize,
        concat!("Size of: ", stringify!(_dwg_entity_CIRCLE))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_CIRCLE>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_CIRCLE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_CIRCLE),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).center) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_CIRCLE),
            "::",
            stringify!(center)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radius) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_CIRCLE),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thickness) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_CIRCLE),
            "::",
            stringify!(thickness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_CIRCLE),
            "::",
            stringify!(extrusion)
        )
    );
}
#[doc = "CIRCLE (18/3) entity"]
pub type Dwg_Entity_CIRCLE = _dwg_entity_CIRCLE;
#[doc = "LINE (19/1) entity"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_entity_LINE {
    pub parent: *mut _dwg_object_entity,
    pub z_is_zero: BITCODE_RC,
    pub start: BITCODE_3BD,
    pub end: BITCODE_3BD,
    pub thickness: BITCODE_BT,
    pub extrusion: BITCODE_BE,
    pub unknown_r11: BITCODE_2RD,
}
#[test]
fn bindgen_test_layout__dwg_entity_LINE() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_entity_LINE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_entity_LINE>(),
        112usize,
        concat!("Size of: ", stringify!(_dwg_entity_LINE))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_entity_LINE>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_entity_LINE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_LINE),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z_is_zero) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_LINE),
            "::",
            stringify!(z_is_zero)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_LINE),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_LINE),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thickness) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_LINE),
            "::",
            stringify!(thickness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extrusion) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_LINE),
            "::",
            stringify!(extrusion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unknown_r11) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_dwg_entity_LINE),
            "::",
            stringify!(unknown_r11)
        )
    );
}
#[doc = "LINE (19/1) entity"]
pub type Dwg_Entity_LINE = _dwg_entity_LINE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dwg_DIMENSION_common {
    pub parent: *mut _dwg_object_entity,
    pub class_version: BITCODE_RC,
    pub extrusion: BITCODE_BE,
    pub def_pt: BITCODE_3BD,
    pub text_midpt: BITCODE_2RD,
    pub elevation: BITCODE_BD,
    pub flag: BITCODE_RC,
    pub flag1: BITCODE_RC,
    pub user_text: BITCODE_TV,
    pub text_rotation: BITCODE_BD,
    pub horiz_dir: BITCODE_BD,
    pub ins_scale: BITCODE_3BD,
    pub ins_rotation: BITCODE_BD,
    pub attachment: BITCODE_BS,
    pub lspace_style: BITCODE_BS,
    pub lspace_factor: BITCODE_BD,
    pub act_measurement: BITCODE_BD,
    pub unknown: BITCODE_B,
    pub flip_arrow1: BITCODE_B,
    pub flip_arrow2: BITCODE_B,
    pub clone_ins_pt: BITCODE_2RD,
    pub dimstyle: BITCODE_H,
    pub block: BITCODE_H,
}
#[test]
fn bindgen_test_layout__dwg_DIMENSION_common() {
    const UNINIT: ::std::mem::MaybeUninit<_dwg_DIMENSION_common> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_dwg_DIMENSION_common>(),
        216usize,
        concat!("Size of: ", stringify!(_dwg_DIMENSION_common))
    );
    assert_eq!(
        ::std::mem::align_of::<_dwg_DIMENSION_common>(),
        8usize,
        concat!("Alignment of ", stringify!(_dwg_DIMENSION_common))
